{
    "2000": {
        "Driver changes": [
            "Rubens Barrichello, who scored three podiums for Stewart in 1999, signed for Ferrari, replacing Eddie Irvine. The previous season's runner-up joined the newly established Jaguar team, in what was essentially a straight swap with Barrichello.",
            "1996 champion Damon Hill retired from Formula One at the end of the 1999 season. Jarno Trulli moved from Prost to Jordan, filling Hill's vacant seat. Prost's other driver Olivier Panis left the team to become the test driver for McLaren. The two seats at the French team were taken by Jean Alesi, who moved from Sauber, and 1999 International Formula 3000 champion Nick Heidfeld, who had previously been a test driver at McLaren. Mika Salo signed for Sauber after short spells as an injury replacement for Ricardo Zonta for three races and Michael Schumacher for six races in 1999.",
            "2009 World Champion Jenson Button made his debut for Williams after beating the team's test driver Bruno Junqueira in a 'shoot-out' test. Button replaced Alessandro Zanardi at the team. The Italian returned to motor racing in 2001, when he rejoined the CART championship.",
            "Toranosuke Takagi left Formula One to drive for Nakajima Racing in Formula Nippon, where he won the 2000 title. His place at Arrows was taken by Jos Verstappen, whose previous Formula One race had been the 1998 Japanese Grand Prix, when he was driving for Stewart.",
            "Gastón Mazzacane was promoted to a Minardi race drive for 2000, after spending the previous season as their test driver. The Argentine driver took the place of Luca Badoer, who was unable to find a race seat, and so focused on his role as test driver for Ferrari. Stéphane Sarrazin, who had driven for Minardi at the 1999 Brazilian Grand Prix, became the test driver for Prost.",
            "Mid-season changes",
            "Jaguar test driver Luciano Burti made his racing debut at Austria, replacing the ill Eddie Irvine."
        ]
    },
    "2001": {
        "Driver changes": [
            "Olivier Panis left his test position with McLaren to take up a full-time drive with BAR. He took the place of Ricardo Zonta, with the Brazilian taking up the position of test driver with Jordan.",
            "Still on contract to Williams, Jenson Button was loaned to Benetton for the season. Button replaced Alexander Wurz at Benetton, as the Austrian had fallen out of favour with team boss Flavio Briatore and moved on to become a test driver at McLaren. Button's place in the Williams was taken over by Juan Pablo Montoya, who had been tied to Williams since 1998 but had been loaned to the CART series in 1999, where he took the title in his first attempt as well as a victory in the Indianapolis 500.",
            "Marc Gené lost his seat at Minardi due to sponsorship problems. Gené signed a contract to become a test driver at Williams where he remained until the end of 2004, and was replaced with debutant Fernando Alonso. Gastón Mazzacane also moved away from Minardi for 2001, having been replaced by the returning Tarso Marques.",
            "Mazzacane beat CART driver Oriol Servià for the Prost seat, replacing Nick Heidfeld – who subsequently left the team and moved to Sauber. Kimi Räikkönen was signed alongside Heidfeld for a full drive from near obscurity. The Finn had performed some testing for Sauber in late 2000 after dominating the British Formula Renault series, and so impressed Peter Sauber that he was given the full-time drive. Pedro Diniz did not return as a driver for Sauber, but instead purchased 40% of the Prost team and served in a management role there in 2001.",
            "Johnny Herbert decided to leave the Jaguar team in an attempt to secure a drive in Champ Cars. The deal did not work out, and he was forced to sign on with Arrows as a test driver for 2001. Luciano Burti stepped up from test driver to fill Herbert's slot at Jaguar.",
            "Pedro de la Rosa lost his drive at Arrows to Enrique Bernoldi and signed on as a reserve driver with Prost.",
            "Mid-season changes[edit]",
            "During the season, Jean Alesi quit his Prost drive and later joined the Jordan team.",
            "Gastón Mazzacane was fired by the Prost team after the San Marino Grand Prix. He was replaced with Jaguar's Luciano Burti, who was subsequently replaced with Prost reserve driver Pedro de la Rosa.",
            "Heinz-Harald Frentzen suffered injuries after a crash and was replaced for the Canadian GP by reserve driver Ricardo Zonta. After returning from his injuries, Frentzen's contract was terminated by Jordan after the British GP. The split was not a happy one, and the matter ended in court before the season's end. Zonta took over Frentzen's drive for the German GP.",
            "Jean Alesi quit his Prost drive after the German Grand Prix. Frentzen was then signed to Prost to take over from Alesi, before Jordan completed a straight swap by signing Alesi – with both drivers remaining in their new seats for the rest of the season.",
            "Alex Yoong was granted his FIA super-licence during the 2001 season and replaced Tarso Marques in the Minardi starting lineup at the Italian Grand Prix. Marques moved into a reserve/test role for the rest of the season.",
            "Luciano Burti suffered serious injuries during a crash in the Belgian GP. He was forced to sit out the rest of the 2001 season and was replaced by Czech driver Tomáš Enge for the remaining races."
        ]
    },
    "2002": {
        "Driver changes": [
            "The 2002 season featured several driver line-up changes before the season and more changes during the season proper.",
            "With three races left to go in the 2001 season, 1998 and 1999 World Champion Mika Häkkinen announced that he was not intending to drive in F1 in 2002. Denying any claim of retirement, he stated that he needed a sabbatical and would return to McLaren at a later time. Häkkinen later officially left McLaren and retired from F1 at the end of 2001, eventually returning to racing in DTM in 2005, despite being linked with the Williams team for a Formula One comeback. Häkkinen's seat at McLaren was taken by his fellow Finn 2007 World Champion Kimi Räikkönen, after he was released by Sauber. Räikkönen was replaced at Sauber by the 2001 Euro Formula 3000 champion Felipe Massa.",
            "Midway through 2001, Giancarlo Fisichella announced his intention to leave Benetton after 2001 to drive for Jordan. Benetton, renamed as Renault, replaced Fisichella with Jordan driver Jarno Trulli, meaning that Fisichella and Trulli had swapped seats at the two teams. Jordan completed an all-new lineup for 2002 with BAR test driver Takuma Sato, whose position in the large test driver pool at BAR was taken by compatriot Ryo Fukuda. Jean Alesi, who had driven for Jordan at the end of the 2001 season, did not seriously pursue an F1 drive for 2002 and instead signed up a drive with Mercedes in the DTM series. Ricardo Zonta, realising that he had no future at Jordan, left his reserve seat there to drive in the Telefonica World Series, later returning to F1 in 2003 as a test driver for Toyota.",
            "Heinz-Harald Frentzen, without a drive after the collapse of Prost, joined the Arrows team for 2002. This was his third different team within two seasons, after having been dumped by Jordan mid-season in 2001 and subsequently joining Prost until that team's collapse. Despite being under contract for another season, Jos Verstappen lost his Arrows seat to Frentzen, and the Dutchman was unable to secure a drive at another team. He later resurfaced at Minardi in 2003.",
            "Fernando Alonso left Minardi after an impressive 2001 campaign, and signed on with Renault as a test driver. Alonso's seat was taken over by Benetton test driver, and International Formula 3000 series runner-up, Mark Webber.",
            "For their first season in Formula One, Toyota employed Mika Salo (formerly with Sauber in 2000) and debutant Allan McNish, who had previously driven a Toyota GT-One at Le Mans.",
            "Luciano Burti, who had driven for both Jaguar and Prost in 2001, left the struggling Prost team before their collapse in order to join Luca Badoer in a test role at Ferrari. Tomáš Enge, who had filled in for the injured Burti at Prost in 2001, was dropped by the team at the end of the 2001 season for financial reasons, and he returned to International Formula 3000 for 2002.",
            "Antônio Pizzonia was signed to become a Williams test driver alongside Marc Gené. Pizzonia had been driving a Williams sponsored car in the International F3000 series in 2001, and he continued that drive in 2002 along with his test duties at Williams.",
            "André Lotterer, who drove for the Jaguar Junior Team in the British Formula 3 series in 2001, was signed as a test driver for Jaguar's Formula One team for 2002.",
            "Mid-season changes",
            "Heinz-Harald Frentzen decided to leave Arrows following the German Grand Prix due to the uncertain future of that team. Arrows collapsed several days later and did not take part in the rest of the season, which also left Enrique Bernoldi without a drive. Frentzen signed with Sauber for the 2003 season, and stood in for Felipe Massa in the United States Grand Prix, for which the Brazilian had incurred a 10-position penalty from the previous race in Monza, thereby eliminating Massa's penalty.",
            "BAR test driver Anthony Davidson made his Formula One debut when he replaced Alex Yoong at Minardi for the Hungarian and Belgian Grands Prix. The team suspended the Malaysian after he failed to qualify for the third occasion in 2002. Minardi had planned to replace Yoong with Justin Wilson, but Wilson was too tall to fit into the car in accordance with the safety requirements."
        ]
    },
    "2003": {
        "Driver changes": [
            "Fernando Alonso, the team's test driver in 2002, was promoted to a full-time drive at Renault, replacing Jenson Button. Button moved to BAR, where he took the seat vacated by the Toyota-bound Olivier Panis. Panis joined Formula One debutant, and reigning CART champion, Cristiano da Matta at the Japanese team, in an all-new lineup for 2003. Allan McNish, one of the drivers replaced at Toyota, signed with Renault as a test driver, while his teammate from 2002, Mika Salo, left Formula One altogether.",
            "Felipe Massa left his Sauber drive to assume the duties of test driver for Ferrari. His place at Sauber was taken by Heinz-Harald Frentzen, who had replaced Massa on a one-off basis for the United States Grand Prix (by which time Frentzen was already confirmed as a Sauber driver for 2003), after having driven for Arrows before the team's collapse.",
            "Takuma Sato left the Jordan team to take the place of several others (Anthony Davidson, Darren Manning, Ryo Fukuda and Patrick Lemarié) as the sole test driver for BAR, being replaced by 2002 Formula Nippon champion Ralph Firman.",
            "Jaguar replaced both Eddie Irvine and Pedro de la Rosa for 2003. Their new drivers were Mark Webber, who signed from Minardi, and debutant Antônio Pizzonia, who drove in the International Formula 3000 series in 2002 whilst also performing test driver duties for Williams. Webber's vacated seat at Minardi was filled by Justin Wilson, who had won the International Formula 3000 title in 2001. Alex Yoong's Minardi contract from 2002 was not renewed and he moved to the CART series, albeit only for a brief stint, in 2003. He was replaced at Minardi by Jos Verstappen, who had spent a season on the sidelines after losing his Arrows drive to Heinz-Harald Frentzen in 2002.",
            "Mid-season changes",
            "Minardi's Justin Wilson joined Jaguar from the German Grand Prix onwards, filling in for the under-performing Antônio Pizzonia, who was offered a test driving role at the team but turned it down. He would later resurface as a test driver at Williams. Wilson's seat at Minardi was taken by the Danish driver Nicolas Kiesa, who joined Formula One from the International Formula 3000 series.",
            "Ralph Firman suffered injuries as a result of a crash during practice in Hungary. He was replaced by Zsolt Baumgartner for two races before returning to finish the season for Jordan. Baumgartner, another driver who had been competing in the International Formula 3000 series, was the first Hungarian driver to race in Formula One.",
            "Ralf Schumacher was unable to race in Italy, due to concussion. He was replaced at Williams by Marc Gené, the team's test driver, for that particular race, before returning for the following Grand Prix.",
            "After a string of disappointing results in 2003, Jacques Villeneuve elected to end his season one race early, and was replaced at BAR by test driver Takuma Sato for the Japanese Grand Prix. Villeneuve would later drive for Renault in 2004 as a replacement driver, and sign a multi-year contract at Sauber for 2005 (though he was replaced in 2006)."
        ]
    },
    "2004": {
        "Driver changes": [
            "The 2004 season featured several driver line-up changes prior to the season, and more changes during the season proper. Minardi, Jordan, and Sauber started 2004 with completely new driver line-ups.",
            "At BAR, following Jacques Villeneuve's departure from the team before the 2003 Japanese Grand Prix, former test driver Takuma Sato was permanently given the second race seat alongside Jenson Button; after serving in a temporary capacity during 2003, Anthony Davidson became the permanent test driver replacing Takuma Sato.",
            "At Minardi, Nicolas Kiesa was unable to keep his seat and was released. Jos Verstappen left Minardi as a result of sponsorship problems and an unwillingness to spend another year competing with other backmarkers in the non-competitive team. Gianmaria Bruni, who had performed a limited amount of testing in 2003, was signed to a full-time drive. Zsolt Baumgartner was confirmed as the second full-time driver after the Hungarian government provided sponsorship; Baumgartner had performed replacement duties at Jordan in 2003 after Ralph Firman suffered injuries from a crash in Hungary. Completing the all-new line-up, Bas Leinders and Tiago Monteiro were signed as test drivers for 2004. Leinders was signed from the ranks of the World Series by Nissan, while Monteiro was signed from the American Fittipaldi Champ Car team.",
            "Heinz-Harald Frentzen and Sauber mutually parted ways at the end of 2003. Frentzen then moved out of F1 and joined fellow ex-F1 drivers Mika Häkkinen and Jean Alesi in the DTM. Nick Heidfeld was also released by Sauber, and appeared to have no drive for 2004. However several successful test drives at Jordan landed him a seat there. Fisichella left Jordan after 2003 having signed a drive for Sauber. This meant that Heidfeld and Fisichella effectively swapped seats. Sauber's other new driver was Felipe Massa, who left his test position at Ferrari and returned to the team where he had raced in 2002. As Sauber used Ferrari engines in 2003, Massa took considerable knowledge of Ferrari components with him.",
            "Choosing not to extend Justin Wilson's contract, Jaguar signed Christian Klien to partner Mark Webber in the R5. Wilson turned down a test drive and departed Jaguar to join the Mi-Jack Conquest Racing team in Champ Car racing in America. Björn Wirdheim was signed as their Friday test driver. The other Friday test drivers are Franck Montagny, who was rewarded for a championship year in the World Series by Nissan with a permanent test drive at Renault, Ryan Briscoe, who joined Ricardo Zonta as a test driver at Toyota, and Pedro de la Rosa, who returned to F1 as a test driver for McLaren.",
            "Mid-season changes[edit]",
            "Giorgio Pantano was replaced by Timo Glock at the Canadian Grand Prix. Pantano left Jordan after the Italian Grand Prix, with Glock replacing him again for the remainder of the season.",
            "After Ralf Schumacher was injured during the United States Grand Prix, Marc Gené replaced him at the French and British Grands Prix. Antônio Pizzonia then replaced him from the German Grand Prix to the Italian Grand Prix. Schumacher returned for the Chinese Grand Prix.",
            "Cristiano da Matta was replaced by test driver Ricardo Zonta from the Hungarian Grand Prix onward. Zonta was dropped by Toyota for the Japanese Grand Prix before replacing Olivier Panis at the Brazilian Grand Prix, who stepped down from his race seat and retired from the sport.",
            "Jarno Trulli's relationship with the Renault team deteriorated after his first victory at the 2004 Monaco Grand Prix.  He left the team after the 2004 Italian Grand Prix, which was also Pantano's last race for the Jordan team. Former world champion Jacques Villeneuve replaced Jarno Trulli at Renault for the final three races.  Trulli missed the 2004 Chinese Grand Prix, but he returned in the 2004 Japanese Grand Prix and the 2004 Brazilian Grand Prix with the Toyota team. That meant the 2004 Japanese Grand Prix was Jarno Trulli's first race with the new team.",
            "Team changes[edit]",
            "As part of a global restructuring and cost-cutting exercise, Ford announced during the season that they would not be entering into the F1 championship in 2005 via their Jaguar team. They also announced that their Cosworth motor and engineering divisions were being sold. The Jaguar team was eventually bought by Red Bull and continued to compete under the Red Bull Racing name in 2005."
        ]
    },
    "2005": {
        "Driver changes": [
            "Renault partnered Fernando Alonso with the 2004 Sauber driver Giancarlo Fisichella, in a straight swap with Jacques Villeneuve (who had taken over from Jarno Trulli at Renault for the last three races of the season).",
            "Williams employed an all-new driver line-up in 2005, having signed Jaguar's Mark Webber and Jordan's Nick Heidfeld to replace Juan Pablo Montoya and Ralf Schumacher. Montoya moved to McLaren, in place of the Red Bull-bound David Coulthard (who took Webber's vacated seat), while Ralf Schumacher signed for Toyota. This meant that Ricardo Zonta, who had raced for Toyota in five of the final six races of 2004, returned to a third driver role in 2005. Olivier Panis, who had driven in seventeen out of eighteen races for Toyota in 2004, was retained by the team in the dual capacity of advisor and test driver. Cristiano da Matta, who had started the 2004 season with Toyota, returned to Champ Car in 2005. Jarno Trulli joined as Toyota's second driver.",
            "Jordan's other driver from the end of 2004, Timo Glock, also switched to Champ Car for 2005, leaving Jordan with two vacant seats. They were taken by Tiago Monteiro (a test driver for Minardi in 2004) and Narain Karthikeyan, both Formula One debutants, who had both competed in the previous year's World Series by Nissan season. Giorgio Pantano, who raced for Jordan for the majority of 2004, left Formula One altogether, joining the Super Nova Racing team for the inaugural GP2 Series season.",
            "Minardi also ran an all-new line-up in 2005, with their 2004 drivers—Gianmaria Bruni (who switched to GP2 in 2005) and Zsolt Baumgartner—being replaced by a pair of debutants: Patrick Friesacher and Christijan Albers, who had competed in International Formula 3000 and DTM, respectively, during the previous season.",
            "Mid-season changes",
            "BAR test driver Anthony Davidson raced in Malaysia in place of an ill Takuma Sato. Sato returned to the seat for the next race.",
            "Following a shoulder injury to Juan Pablo Montoya, McLaren reserve driver Pedro de la Rosa raced for the team in Bahrain, with Alexander Wurz taking on third driver duties in place of de la Rosa. For the San Marino Grand Prix, de la Rosa and Wurz swapped roles. Montoya returned for the following race.",
            "Vitantonio Liuzzi and Christian Klien were both contracted to Red Bull Racing to participate in at least three races, and agreed to share their race seat for the season. While Klien, who had raced for the team's forerunners Jaguar in 2004, drove in the first three races, Liuzzi replaced him for the San Marino, Spanish, Monaco, and European Grands Prix. Klien returned for the Canadian Grand Prix, and completed the remainder of the season.",
            "Robert Doornbos was Jordan's third driver for nine of the first eleven races of the season. Franck Montagny replaced him at the European Grand Prix, while Jordan were banned from using a third car at the Canadian Grand Prix after using too many tyres at the previous race. Nicolas Kiesa replaced Doornbos for the German Grand Prix onwards, when the Dutchman replaced Patrick Friesacher at Minardi due to sponsorship issues.",
            "Chanoch Nissany became Minardi's third driver for the Hungarian Grand Prix. He was replaced by Enrico Toccacelo for the Turkish Grand Prix and Italian Grand Prix. Nissany was the first Israeli to participate in a Formula One weekend.",
            "Antônio Pizzonia replaced Nick Heidfeld at Williams for the Italian Grand Prix, when Heidfeld decided to withdraw after complaining of a severe headache. Earlier in the week, he had crashed heavily during a test session at Monza. Heidfeld had been due to return for the Brazilian Grand Prix, but after having a motorcycle accident he was forced to sit out the remainder of the season, with Pizzonia continuing to race for Williams in Heidfeld's absence."
        ]
    },
    "2006": {
        "Driver changes": [
            "Ferrari replaced Michael Schumacher's longtime teammate Rubens Barrichello with fellow Brazilian Felipe Massa, who moved from Sauber. Massa had previously tested with Ferrari in 2003. Massa was replaced at the newly renamed BMW Sauber team by Nick Heidfeld, who had driven for BMW's previous partners Williams for much of 2005. Poland's Robert Kubica took up the third driver's role at BMW Sauber.",
            "Barrichello moved to Honda, where he replaced the outgoing Takuma Sato. The Honda-backed Super Aguri team started the season with Sato and Yuji Ide, an all-Japanese driver line up. Franck Montagny moved from his Renault testing role to become Super Aguri's third driver. His position at Renault was taken by the GP2 runner-up Heikki Kovalainen.",
            "Williams promoted test driver Nico Rosberg, who had won the inaugural GP2 drivers' title, to their second seat alongside Mark Webber. Alexander Wurz, one of McLaren's test drivers from 2005, joined Williams as a third driver, alongside India's Narain Karthikeyan, who had raced for Jordan the previous season. Gary Paffett was promoted to a permanent testing role at McLaren alongside Pedro de la Rosa.",
            "Karthikeyan's seat at Jordan, now renamed as MF1, was taken by the 2005 Minardi driver Christijan Albers. MF1 decided to employ a rotation system for their third driver position. Minardi's other driver, Robert Doornbos, took up a test driving role at Red Bull. Vitantonio Liuzzi, who had shared Red Bull's second seat with Christian Klien in 2005, moved to Red Bull's newly acquired sister team Toro Rosso—previously Minardi—where he partnered his fellow Red Bull-backed driver Scott Speed. The Swiss driver Neel Jani became Toro Rosso's third driver.",
            "Mid-season changes[edit]",
            "After the San Marino Grand Prix Super Aguri's Yuji Ide had his superlicence revoked by the FIA and could no longer race in Formula One. He was replaced by the team's reserve driver Franck Montagny for the next race. Super Aguri hired Sakon Yamamoto, one of Jordan's test drivers from 2005, to be their third driver from the British Grand Prix onwards, in place of the promoted Montagny. Yamamoto and Montagny switched places from the German Grand Prix onwards.",
            "After the United States Grand Prix, Juan Pablo Montoya announced he was moving to NASCAR for the 2007 season and leaving McLaren. The next day, McLaren announced that Montoya would be replaced in their driver line up by test driver Pedro de la Rosa, ending Montoya's five and a half-year F1 career since 2001.",
            "Robert Kubica was promoted to a race seat by BMW Sauber at the Hungarian Grand Prix, replacing 1997 World Champion Jacques Villeneuve, possibly due to Villeneuve's injuries after a heavy crash in the German Grand Prix. On the day after the Hungarian GP (7 August 2006), BMW Sauber announced that Villeneuve had left the team with immediate effect, with Kubica replacing him permanently for the remainder of the season. German Formula 3 driver Sebastian Vettel became BMW Sauber's third driver from the Turkish Grand Prix onwards, replacing the promoted Kubica.",
            "On 11 September 2006, Red Bull Racing announced that the team's third/test driver, Robert Doornbos would replace the sacked-Christian Klien for the final three races of the season as a result of Klien's string of poor results. For the races in China and Japan, Michael Ammermüller replaced Doornbos as third driver.",
            "Spyker MF1 announced a duo of new third drivers for two of the final races of the year. GP2 Series drivers Alexandre Prémat and Ernesto Viso took part in practice in China and Brazil respectively; Adrian Sutil, who had previously tested in Germany and France, again tested for the team in Japan.",
            "During the test at the Silverstone Circuit in September, GP2 Series drivers Lewis Hamilton, Nelson Piquet Jr., and Adrián Vallés performed test duties for McLaren, Renault and MF1, respectively. Super Aguri's former race driver Franck Montagny also tested for Toyota."
        ]
    },
    "2007": {
        "Driver changes": [
            "Kimi Räikkönen (pictured in 2002) left McLaren at the end of the 2006 season to join Ferrari before the season.",
            "The 2005 and 2006 World Champion Fernando Alonso switched to McLaren after five years at Renault. Following the retirement of Michael Schumacher and Jacques Villeneuve, Alonso was the only driver on the grid in this season who had previously won a drivers' championship.",
            "Juan Pablo Montoya, who was a McLaren driver until the aftermath of the 2006 United States Grand Prix moved to the NASCAR Cup Series for 2007, effectively ending his Formula One career, as announced on 9 July 2006.",
            "On 2 August 2006, Williams announced that test and reserve driver Alexander Wurz would step up to a race seat for 2007, replacing Australian Mark Webber. On 7 August 2006, Red Bull Racing announced their 2007 driver line-up of David Coulthard and Mark Webber, displacing Christian Klien. On 7 August 2006, BMW Sauber announced that Jacques Villeneuve's contract had been terminated immediately and for the rest of the season would be replaced by test driver Robert Kubica. Kubica was later announced on 19 October 2006 to retain the race seat for the 2007 season, with Sebastian Vettel remaining as the team's test driver. On 21 December 2006 BMW Sauber announced former Jordan F1 and GP2 driver Timo Glock as their second test driver.",
            "On 6 September 2006, Renault confirmed Heikki Kovalainen as the team's replacement for Fernando Alonso. On 10 September 2006, Scuderia Ferrari announced Kimi Räikkönen to replace for the retiring Michael Schumacher.",
            "On 15 November 2006, Super Aguri confirmed Anthony Davidson as Sakon Yamamoto's replacement. On 24 November 2006, McLaren confirmed Lewis Hamilton, their junior program driver who won the GP2 Series title that year as their second driver.",
            "On 21 December 2006, Spyker confirmed Adrian Sutil as their first driver, replacing WTCC-bound Tiago Monteiro.",
            "On 10 July 2007, Spyker announced that Christijan Albers would no longer be driving for the team. The given reason was a failure to pay sponsorship monies due. Markus Winkelhock raced Spyker's second car at the European Grand Prix. On 25 July 2007 Spyker confirmed that the Japanese driver Sakon Yamamoto would compete in the remaining seven Grands Prix for them. On 31 July 2007, Scuderia Toro Rosso replaced Scott Speed with BMW test driver Sebastian Vettel following an alleged physical altercation between Speed and STR Team Principal Franz Tost.",
            "On 8 October 2007, Williams driver Alexander Wurz announced his immediate retirement from Formula One racing. Williams test driver Kazuki Nakajima replaced Wurz for the Brazilian Grand Prix.",
            "Team changes[edit]",
            "Ferrari technical director, Ross Brawn, was to take a sabbatical year for 2007, after ten seasons at the Italian team since 1997. However, it was later announced that he would leave the team. In 2008, Ross Brawn became Team Principal of the Honda team.",
            "McLaren signed a title sponsorship deal with the telecommunications company Vodafone late in 2005. With the loss of Vodafone, Scuderia Ferrari began a sponsorship deal with Alice, a brand of Telecom Italia.",
            "Mild Seven confirmed that they would not renew their contract with Renault following its conclusion at the end of 2006 due to current European tobacco laws.",
            "British American Tobacco's Lucky Strike and 555 brands ceased to sponsor the Honda team, following which the team ran a sponsorless livery in 2007.",
            "Williams changed their engines from Cosworth to Toyota in a three-year deal until 2009. Contrary to speculation at the time, the engines were not rebadged as Lexus.",
            "Red Bull officially became an Austrian constructor by receiving an Austrian licence, though continued to operate from the same base in Britain.",
            "On 9 September 2006, MF1 Racing was officially sold to a Dutch-Arab consortium owned by Michiel Mol, along with the aid of Spyker Cars.  The team was officially renamed Spyker MF1 Team, keeping the MF1 for the rest of the season due to Concorde Agreement rules. On 30 September 2006, Spyker announced that their engine supplier would be Ferrari.",
            "On 16 October 2006, Renault confirmed that the Dutch banking company, ING, would become their main sponsor to replace Mild Seven, which has sponsored the Enstone-based team during the 13 years since 1994. On 20 October 2006, Williams announced AT&T as their new main sponsor. On 24 October 2006, Spyker announced they would change their name from Spyker MF1 Team to Spyker F1 from 2007 onwards, subject to all other teams giving their agreement. On 31 October 2006, Red Bull confirmed their engine situation for 2007. Renault engines were used by Red Bull Racing, while Scuderia Toro Rosso used 2006-spec Ferrari engines. As a result of Red Bull Racing switching to Renault engines, this marked the first time Renault had supplied more than one team in the sport since the 1997 season (when it supplied Williams and Benetton) as a fully-fledged engine manufacturer (although from 1998-2000 Renault had supplied more than one team but under Mecachrome, Playlife and Supertec branding).",
            "On 15 March 2007, Spyker announced their new title sponsor for the 2007 season: United Arab Emirates airline company Etihad Airways.",
            "Other changes[edit]",
            "On 30 September 2006, Cosworth announced that they would temporarily withdraw from Formula One as an engine supplier, citing lack of room for supplying engines for private teams after Williams switched to Toyota engines and Spyker opted for Ferrari engines from 2007 season onwards and thus for the first time since 1962 a Formula One season did not feature Cosworth-powered cars. However the company would return to the sport from 2010 season onwards."
        ]
    },
    "2008": {
        "Driver changes": [
            "Force India joined the sport after Vijay Mallya purchased the Spyker team.",
            ".mw-parser-output .tmulti .multiimageinner{display:flex;flex-direction:column}.mw-parser-output .tmulti .trow{display:flex;flex-direction:row;clear:left;flex-wrap:wrap;width:100%;box-sizing:border-box}.mw-parser-output .tmulti .tsingle{margin:1px;float:left}.mw-parser-output .tmulti .theader{clear:both;font-weight:bold;text-align:center;align-self:center;background-color:transparent;width:100%}.mw-parser-output .tmulti .thumbcaption{background-color:transparent}.mw-parser-output .tmulti .text-align-left{text-align:left}.mw-parser-output .tmulti .text-align-right{text-align:right}.mw-parser-output .tmulti .text-align-center{text-align:center}@media all and (max-width:720px){.mw-parser-output .tmulti .thumbinner{width:100%!important;box-sizing:border-box;max-width:none!important;align-items:center}.mw-parser-output .tmulti .trow{justify-content:center}.mw-parser-output .tmulti .tsingle{float:none!important;max-width:100%!important;box-sizing:border-box;text-align:center}.mw-parser-output .tmulti .tsingle .thumbcaption{text-align:left}.mw-parser-output .tmulti .trow>.thumbcaption{text-align:center}}",
            "After competing in the sport for ten years, Ralf Schumacher (left) did not take part in the 2008 season. He was replaced at Toyota by 2007 GP2 Champion, Timo Glock (right).",
            "2005 and 2006 World Champion Fernando Alonso left McLaren after a single season to rejoin Renault. He was replaced at McLaren by Heikki Kovalainen, who had replaced Alonso at Renault the previous season. Giancarlo Fisichella, Renault's other driver from 2007, moved to the newly renamed Force India team, in place of erstwhile Spyker driver Sakon Yamamoto, who became Renault's test development driver. Fisichella's place at Renault was taken by the team's test driver Nelson Piquet Jr. (son of the three-time World Drivers' Champion Nelson Piquet).",
            "After an unsuccessful test for Force India in December 2007, Ralf Schumacher left Toyota to drive for Mücke Motorsport in the DTM series. 2007 GP2 champion Timo Glock, who had also been the test driver for BMW Sauber, returned to a Formula One race seat in place of Schumacher. Christian Klien, previously the test driver for Honda, and the Estonian driver Marko Asmer took up test driver roles at BMW Sauber.",
            "Sébastien Bourdais, who won his fourth consecutive Champ Car title in 2007, joined Toro Rosso in 2008, replacing Vitantonio Liuzzi, who moved to Force India as their test driver."
        ]
    },
    "2009": {
        "Driver changes": [
            "The only offseason driver change was following the retirement of Red Bull's David Coulthard after 14 years in Formula One. He was replaced by Sebastian Vettel, who had raced for Toro Rosso in 2008. Vettel's seat at Toro Rosso was taken by the Swiss driver Sébastien Buemi, who was Red Bull's test driver in 2008.",
            "Following the German Grand Prix, Toro Rosso's Sébastien Bourdais was dropped by the team, with Toro Rosso principal Franz Tost claiming that the partnership had not met his expectations. Bourdais was replaced by Jaime Alguersuari ahead of the Hungarian Grand Prix. Alguersuari had been racing in Formula Renault 3.5 Series in 2009, and had only signed a deal to replace Brendon Hartley as Toro Rosso's test driver two weeks prior. Bourdais was advised by counsel to file suit for breach of contract by Toro Rosso. Toro Rosso settled the matter with a $2.1 million payment to Bourdais to avoid litigation.",
            "After sustaining an injury during qualifying for the Hungarian Grand Prix, Ferrari's Felipe Massa missed the remainder of the season. He was replaced for the next two races by Ferrari test driver Luca Badoer, but after Badoer failed to score a single point in his two races, Ferrari replaced him with Giancarlo Fisichella who had signed a deal to be a Ferrari test driver for 2010 and had driven for Force India throughout the 2009 season. Fisichella's seat at Force India was taken by Vitantonio Liuzzi, who was Force India's test driver.",
            "Following the Hungarian Grand Prix, Renault parted ways with Nelson Piquet Jr. as he had failed to score a single point and allegations that he had intentionally crashed during the 2008 Singapore Grand Prix surfaced. Piquet was replaced by Romain Grosjean, who was Renault's test driver.",
            "In qualifying for the Japanese Grand Prix, Toyota's Timo Glock crashed heavily at the last corner and was airlifted to hospital with a leg injury. As he was not fit to race, Jarno Trulli was the only driver representing Toyota at the Japanese Grand Prix. On 11 October, Toyota confirmed that its test driver Kamui Kobayashi would make his race debut in the Brazilian Grand Prix, as Glock had suffered further complications from his accident, resulting in a cracked vertebra and he would not be guaranteed to be fit in time to race in Brazil. Kobayashi retained the seat in the final race of the season in Abu Dhabi."
        ]
    },
    "2010": {
        "Driver changes": [
            "Changed teams",
            "2005 and 2006 World Champion Fernando Alonso left Renault to drive for Ferrari in 2010, replacing Kimi Räikkönen who left the team at the end of the 2009 season. Alonso had signed a three-year deal up to the end of 2012, with options for further years.",
            "Rubens Barrichello moved from Brawn to Williams.",
            "Jenson Button joined Lewis Hamilton at McLaren following the failure to negotiate a contract with Mercedes, which bought out his 2009 team, Brawn GP. This meant that McLaren had signed the two most recent World Champions, and had the sport's first double champion line-up since Ayrton Senna and Alain Prost, also driving for McLaren, in 1989.",
            "Timo Glock officially joined Virgin Racing, after leaving the Toyota Racing team.",
            "Kamui Kobayashi, who made his debut for the now-defunct Toyota team at the end of 2009 covering for the injured Timo Glock, transferred to the newly revived Sauber team.",
            "Heikki Kovalainen joined the new Lotus Racing team, after leaving McLaren.",
            "Robert Kubica left BMW Sauber to drive for Renault in 2010, as a replacement for Alonso.",
            "Nico Rosberg left Williams at the end of the 2009 season after four years with the team since 2006, moving to Mercedes.",
            "Jarno Trulli moved from Toyota to Lotus Racing.",
            "Entered Formula One",
            "Bruno Senna made his debut with the new Hispania team.",
            "Michael Schumacher returned to the sport with Mercedes after a 3-year hiatus.",
            "Karun Chandhok, who placed eighteenth in the 2009 GP2 Series for Ocean Racing Technology, joined former iSport International teammate Bruno Senna at Hispania Racing. Chandhok was the second Formula One driver from India, after Narain Karthikeyan drove for Jordan Grand Prix in 2005.",
            "Lucas di Grassi, who placed third in the 2009 GP2 Series for Racing Engineering, joined Timo Glock at Virgin Racing.",
            "Nico Hülkenberg, 2009 GP2 Series champion with ART Grand Prix, made his debut in Formula One with Williams, alongside Barrichello.",
            "Vitaly Petrov, who placed second in the 2009 GP2 Series, moved from Barwa Addax to partner Robert Kubica at Renault, becoming Russia's first driver in the Formula One World Championship.",
            "Bruno Senna, nephew of three-time World Champion Ayrton Senna, joined Hispania Racing in 2010, returning the Senna name to Formula One sixteen years after his uncle's death in 1994.",
            "Exited Formula One",
            "Giancarlo Fisichella became Ferrari's reserve and test driver in 2010, having left Force India and joined Ferrari towards the end of 2009. After failing to secure a racing drive, he signed up to take part in the Le Mans Series.",
            "Romain Grosjean was unable to secure a contract with Renault, due to Petrov's appointment as Renault's second driver and competed in the inaugural FIA GT1 World Championship for Matech Competition.",
            "After a poor 2009 season, Williams driver Kazuki Nakajima was unable to secure a drive for 2010. On 19 February, it was confirmed that he would join aspiring Serbian outfit Stefan Grand Prix, despite their lack of an entry to the grid.",
            "2007 World Champion Kimi Räikkönen took a two-year \"sabbatical\" from Formula One in 2010 after his managers confirmed that negotiations with McLaren officially came to an end. Räikkönen instead joined the Citroën Junior Team in the 2010 World Rally Championship, driving a Citroën C4 WRC in twelve of the thirteen rounds of the championship.",
            "Returned to Formula One",
            "Pedro de la Rosa returned to Formula One driving for the Sauber team, having previously served as test driver for McLaren. His return ended a three-year absence from racing since 2007, his last Grand Prix start being a half-season campaign in 2006.",
            "Seven-time World Champion Michael Schumacher officially joined Mercedes on 23 December 2009, ending a three-year hiatus from the sport since 2007. Schumacher had originally intended to make a comeback with Ferrari in 2009 to stand in for the injured Felipe Massa, but was prevented from doing so by a motorcycle accident injury, and the Mercedes contract was not signed until he was given a clean bill of health. Schumacher previously raced for Mercedes in the 1991 World Sportscar Championship.",
            "Mid-season changes",
            "Sakon Yamamoto, who last drove in Formula One for Spyker and tested for Renault, replaced Bruno Senna at Hispania for the British Grand Prix, having previously taken part in Friday practice at the Turkish Grand Prix. The team confirmed that Senna would return to his seat for the German Grand Prix. Yamamoto then replaced Karun Chandhok from the German Grand Prix onwards, except the races in Singapore, Brazil and Abu Dhabi, where the seat was filled by Christian Klien.",
            "During the mid-season hiatus, Nick Heidfeld left Mercedes to take up a new role with Pirelli as their official test driver ahead of their return to Formula One.",
            "Following the end of the European season at the Italian Grand Prix, Pedro de la Rosa was dropped by BMW Sauber and summarily replaced by Nick Heidfeld, who last drove for the team in 2009. It was reported that the change was made because of de la Rosa's poor performance relative to teammate Kamui Kobayashi in general and Heidfeld's knowledge of the Marina Bay and Yas Marina circuits in particular. With Heidfeld joining Sauber, former Renault driver Romain Grosjean was drafted in as his replacement for Pirelli.",
            "Hispania Racing test driver Christian Klien replaced Sakon Yamamoto for the Singapore Grand Prix after Yamamoto allegedly contracted food poisoning ahead of the race, but was later seen in the Singapore paddock suffering no apparent symptoms, sparking talk of unpaid debts by the Japanese driver and further financial afflictions for the team to deal with when the logo of one of Klien's personal sponsors appeared on the car for the weekend. Team principal Colin Kolles confirmed that the arrangement would be for one race and Yamamoto would return to the cockpit at Suzuka, provided he recovered in time. Klien also replaced Yamamoto at Interlagos and Abu Dhabi, though no explanation was given for the change."
        ]
    },
    "2011": {
        "Driver changes": [
            "DAMS GP2 driver Jérôme d'Ambrosio replaced Lucas di Grassi at Virgin Racing, having previously driven for the team during Friday practice sessions at selected events in 2010. Di Grassi did not have his contract with Virgin Racing renewed. With only a handful of vacant racing seats available ahead of the winter testing period, he announced that would concentrate on a return to the sport in 2012 rather than attempt to secure a seat in 2011.",
            "DTM champion Paul di Resta replaced Vitantonio Liuzzi at Force India, having previously driven for the team during Friday practice sessions at selected events in 2010.",
            "Nico Hülkenberg was dropped by Williams on the eve of the 2010 Abu Dhabi Grand Prix. After turning down offers from several teams, including HRT and Virgin, Hülkenberg joined Force India as test and reserve driver. As a part of his arrangement with the team, Hülkenberg drove a VJM04 in the Friday morning free practice session of each Grand Prix.",
            "Narain Karthikeyan returned to Formula One with Hispania after last racing with Jordan Grand Prix in 2005, which was run at the time by Hispania team principal Colin Kolles. Karthikeyan also collaborated with Kolles on an unsuccessful attempt at the 2009 24 Hours of Le Mans, and he competed in the 2010 NASCAR Camping World Truck Series in a limited campaign. He also competed in an A1GP season for India.",
            "Robert Kubica was injured while competing in the Ronde di Andora rally during the winter off-season, leaving him with multiple fractures to his arm, hand and leg. The nature of his injuries were serious enough to prevent him from starting the season, while the surgeon who operated on Kubica has said that his recovery could take up to an entire year. His former BMW Sauber teammate Nick Heidfeld was later confirmed as his replacement at Lotus Renault GP.",
            "After being released from his contract with Force India one year in advance of its expiration, Vitantonio Liuzzi officially joined Hispania Racing as their second driver at the final test of the season, filling the last vacant racing seat on the grid. As a result of this, Hispania's part-time racing drivers Karun Chandhok, Christian Klien and Sakon Yamamoto were all unable to secure contracts to race.",
            "2010 GP2 Series champion Pastor Maldonado was signed by Williams after testing for the team in the young driver tests in Abu Dhabi.",
            "Sergio Pérez, runner-up in the GP2 Series for Barwa Addax, was signed by Sauber to partner Kamui Kobayashi. His signing coincided with the announcement of a partnership between Carlos Slim's telecommunications group Telmex and the Sauber team. Pérez would become the first Mexican driver to race in Formula One since Héctor Rebaque last raced for Brabham at the 1981 Caesars Palace Grand Prix.",
            "Bruno Senna left Hispania Racing after a single season. Comments made by team principal Colin Kolles suggested that the nephew of three-time World Champion Ayrton Senna had a strained relationship with the team. Senna was later confirmed to have joined Lotus Renault GP as a part of their test and reserve team, and is the first in line to take over driving duties should either of the team's established drivers be unable to race.",
            "Sakon Yamamoto moved from Hispania Racing as a full-time driver to become a test driver for Virgin Racing for the first three races after he was unable to secure a contract to continue racing with Hispania.",
            "Mid-season changes",
            "Pedro de la Rosa replaced Sergio Pérez at the Canadian Grand Prix due to Pérez feeling unwell after the first practice session, following a heavy crash at the previous round in Monaco.",
            "On 30 June, Hispania Racing announced that Australian Daniel Ricciardo – at the time testing and reserve driver for Scuderia Toro Rosso and racing for ISR in the Formula Renault 3.5 Series – would be replacing Narain Karthikeyan for the remainder of the 2011 season in what was described as an audition for a future race seat with Scuderia Toro Rosso.",
            "Karun Chandhok returned to Formula One, replacing Jarno Trulli at Team Lotus for the German Grand Prix, having previously fulfilled a Friday testing role in Melbourne, Istanbul, Valencia and Silverstone. Chandhok's last race meeting had been the 2010 British Grand Prix when he raced for Hispania. Trulli returned to the car for the Hungarian Grand Prix.",
            "On 24 August, it was announced that Bruno Senna would replace Nick Heidfeld at Renault for the Belgian and Italian Grands Prix, leading to uncertainty over the status of the seat from the Singapore Grand Prix onwards. The team cited Heidfeld's failure to deliver speed to take on the role of a strong leader as the reason for his dismissal, rather than financial reasons. Renault indicated that they wished for Senna to race for the rest of the season, but \"legal issues\" threatened Senna's contract with the team. On 2 September, Renault confirmed that Heidfeld's contract had been legally terminated and Senna would drive alongside Vitaly Petrov for the remainder of the season.",
            "Narain Karthikeyan returned to Hispania for the Indian Grand Prix, replacing Daniel Ricciardo in the 22 car which meant Ricciardo replaced Liuzzi in the 23 car. Liuzzi returned to the team for the Abu Dhabi Grand Prix."
        ]
    },
    "2012": {
        "Driver changes": [
            "Romain Grosjean returned to Formula One with Lotus, the same team – then known as Renault F1 – with whom he made his debut in 2009.",
            "Kimi Raikkonen (pictured in 2017) returned to Formula One with Lotus after two years in rallying.",
            "The 2012 season saw several driver changes. Lotus chose not to take up an option on Vitaly Petrov's contract, and did not offer Bruno Senna a new contract. Petrov and Senna were replaced by 2007 World Drivers' Champion Kimi Räikkönen – returning to the sport after two seasons competing in the World Rally Championship – and reigning GP2 Series champion Romain Grosjean, who also returned to the sport after a two-year absence. Petrov later replaced Jarno Trulli at Caterham; Trulli's replacement meant that the opening race of the season would be the first race since the 1973 German Grand Prix to take place without an Italian driver on the grid. Senna joined Williams, the team having previously attempted to secure Räikkönen for the season. Senna replaced Rubens Barrichello, who left Formula One after a record-breaking nineteen seasons. He later moved to IndyCar for the 2012 season, joining KV Racing Technology.",
            "Like Räikkönen and Grosjean, Nico Hülkenberg also returned to Formula One, joining Force India alongside Paul di Resta. Adrian Sutil left the team, having spent six years with both Force India and its previous incarnations, Spyker and Midland. He initially sought a drive with Williams, before negotiations collapsed in December 2011. Sutil was later the subject of criminal action, charged with grievous bodily harm after allegedly assaulting a senior Renault team member with a glass in a Shanghai nightclub following the 2011 Chinese Grand Prix. Sutil was found guilty, and was sentenced to an eighteen-month suspended jail sentence and ordered to pay a €200,000 fine. Despite this, Sutil rejoined Force India for the 2013 season.",
            "Scuderia Toro Rosso did not retain Jaime Alguersuari or Sébastien Buemi, instead choosing to replace them with Daniel Ricciardo and 2011 Formula Renault 3.5 Series runner-up Jean-Éric Vergne. Ricciardo had previously served as the team's test and reserve driver before being placed at HRT for the 2011 British Grand Prix, while Vergne had completed a limited testing schedule for the team in the second half of the 2011 season. Sébastien Buemi became Red Bull Racing's testing and reserve driver contested the 24 Hours of Le Mans with Toyota, driving a TS030 Hybrid. Alguersuari was offered a seat at HRT, but turned it down and instead joined tyre supplier Pirelli as their test driver, developing tyre compounds for use in racing alongside former Virgin Racing driver Lucas di Grassi.",
            "Pedro de la Rosa and Narain Karthikeyan returned to Formula One with HRT. De la Rosa had been without a full-time drive since the 2010 Italian Grand Prix, having spent the majority of the 2011 season as a test driver for McLaren and making one appearance racing for Sauber; Karthikeyan was dropped by the team before the 2011 British Grand Prix in favour of Ricciardo. He, too, made a one-race appearance at the Indian Grand Prix, before leaving the team until the 2012 season began. Vitantonio Liuzzi, who drove for HRT in 2011, joined the Indian i1 Super Series. The series was later postponed until 2013, but Liuzzi was unable to retain his seat with the team. At the launch of the HRT F112 in March, Liuzzi was confirmed as one of the team's testing and reserve drivers alongside both former GP2 Series driver Dani Clos and Ma Qinghua, the first ever Chinese driver to step into a Formula 1 car.",
            "Jérôme d'Ambrosio left Marussia (then known as Virgin Racing) after the 2011 Brazilian Grand Prix. He later joined Lotus F1 as their third driver. Charles Pic – who placed fourth in the 2011 GP2 Series driving for Addax – joined Marussia, replacing d'Ambrosio.",
            "Mid-season changes[edit]",
            "The season only saw one driver change, which was brought about when Lotus driver Romain Grosjean was found by race stewards to be responsible for causing a multi-car pile-up at the start of the Belgian Grand Prix. He was given a one-race ban and a €50,000 fine for his role in the collision, forcing him to miss the Italian Grand Prix. He was replaced by the team's testing and reserve driver, Jérôme d'Ambrosio. Grosjean returned to the team for the next round in Singapore."
        ]
    },
    "2013": {
        "Driver changes": [
            "Upon starting his second career in 2010, Michael Schumacher signed a three-year agreement to race for Mercedes AMG. With that deal expiring at the end of the 2012 season, Schumacher was given the option of renewing his contract with the team for 2013. However, in the face of disappointing results over the past three seasons, Schumacher became indecisive about his future, prompting Mercedes to start searching for a new driver. Following a protracted period of negotiation, 2008 World Champion Lewis Hamilton announced that he would join Mercedes for the next three years. The move ended his fourteen-year association with McLaren, and Hamilton later described his decision to change teams as being motivated by the desire to find a new challenge for himself, and that the idea of taking a struggling team and building them up to become a successful one held more appeal to him than \"cruising around with a great team\". Schumacher ultimately announced that he would be retiring from the sport for the second time at the end of the 2012 season.",
            "With Hamilton leaving McLaren, the team sought out Sauber driver Sergio Pérez to replace him. Pérez was previously a member of the Ferrari Driver Academy, and was considered to be the leading candidate to join Ferrari should a vacant seat become available, but said that although he had talked with the team, he had never considered racing for them to be a realistic proposition, adding that McLaren was the best place for him to go.",
            "Nico Hülkenberg left Force India after just one season, despite having originally signed a multi-year deal to race for the team starting in 2012, to fill the vacant seat at Sauber. Hülkenberg was joined by Esteban Gutiérrez, who had previously served as Sauber's testing and reserve driver in 2011 and 2012 whilst campaigning in the GP2 Series. Hülkenberg's place at Force India was taken by Adrian Sutil, who returned to the team after a season out of the sport.",
            "With Hülkenberg and Gutiérrez joining Sauber, Kamui Kobayashi was left without a seat after three seasons with the Swiss team. In a bid to secure a seat, Kobayashi accepted donations from fans to raise as much money as possible. However, shortly after Lotus F1 announced that they would retain Romain Grosjean, Kobayashi announced that he had given up hope of securing a racing seat for the 2013 season. He later joined AF Corse for the 2013 FIA World Endurance Championship. However, he returned to the Formula 1 grid in 2014 with Caterham.",
            "Williams promoted test and reserve driver Valtteri Bottas to a full-time racing seat alongside Pastor Maldonado, replacing Bruno Senna. Bottas, the 2011 GP3 Series champion, made regular appearances for Williams during the 2012 season, in official practice sessions at fifteen Grands Prix. Faced with the loss of his seat, Bruno Senna initially sought a drive with Force India, but instead moved to the World Endurance Championship, joining Aston Martin Racing.",
            "Charles Pic moved from Marussia to Caterham, joining former GP2 Series teammate Giedo van der Garde. Pic and van der Garde had previously raced alongside one another as teammates in 2011, racing for Barwa Addax. Where Pic joined Marussia for the 2012 season, van der Garde became Caterham's test driver and contested the 2012 GP2 Series with their GP2 team before being promoted to Formula One. As a result of this, Caterham's 2012 drivers, Heikki Kovalainen and Vitaly Petrov lost their seats for 2013. Caterham team principal Cyril Abiteboul later said that the relationship between the team and Kovalainen had fallen apart towards the end of the 2012 season, leading to his dismissal from the team, whilst Petrov lost his seat due to a lack of sponsorship. Kovalainen later returned to the team to take part in free practice sessions on a temporary basis.",
            "Timo Glock was initially signed to compete for Marussia until the end of the 2014 season, but later announced that he would be leaving the team. Marussia team principal John Booth cited \"tough economic conditions\" as the reason for the team being forced to let Glock go, whilst Glock referenced the loss of tenth place in the 2012 World Constructors' Championship to Caterham at the 2012 Brazilian Grand Prix as the first sign that his position with the team was in danger. Glock moved to the Deutsche Tourenwagen Masters, driving for BMW. With Glock gone, the team elected to take two rookie drivers: Max Chilton, who spent the 2012 season competing in the GP2 Series with the Marussia-backed Carlin team; and GP2 Series runner-up Luiz Razia. However, Razia was removed from Marussia's testing line-up for the second pre-season test in Barcelona, leading to speculation that his future with the team was in jeopardy. It was later reported that his sponsors had missed payments to the team, prompting the decision to suspend his testing programme. His contract to race was terminated twenty-three days after it had been announced, and Razia was replaced by 2009 Formula 3 Euro Series champion and 2012 Formula Renault 3.5 Series runner-up Jules Bianchi.",
            "With HRT withdrawing from the championship, Pedro de la Rosa and Narain Karthikeyan were left without full-time racing seats. De la Rosa later joined Ferrari to aid the team in developing their simulator and was confirmed as one of their test and reserve drivers before the first pre-season test in Jerez, while Karthikeyan began contesting Auto GP.",
            "Mid-season changes[edit]",
            "Kimi Räikkönen was forced to miss the final two races of the season in order to undergo surgery to relieve pain from a back injury he had been suffering from for a long time and which flared up during the Singapore Grand Prix. His place in the team was taken by fellow Finnish racer Heikki Kovalainen."
        ]
    },
    "2014": {
        "Driver changes": [
            "2008 runner-up Felipe Massa left Ferrari at the end of the 2013 season after eight years racing for the team. He moved to Williams, alongside Valtteri Bottas. Pastor Maldonado, having been replaced at Williams by Massa, moved to Lotus F1, taking the seat vacated by 2007 World Champion Kimi Räikkönen. Räikkönen returned to Ferrari, the team he raced for from 2007 to 2009. The partnership of Räikkönen and Fernando Alonso marked the first time since 1954 that Ferrari contested a season with two World Drivers' Champions in the team.",
            "Mark Webber retired from Formula One after twelve seasons, the last seven with Red Bull Racing. He moved to the FIA World Endurance Championship. Daniel Ricciardo left Scuderia Toro Rosso to fill his seat, becoming the second driver to graduate from the team's young driver programme to their premier racing team. Toro Rosso chose 2013 GP3 Series champion Daniil Kvyat as Ricciardo's replacement.",
            "Sergio Pérez left McLaren after a single season with the team. He was replaced by 2013 Formula Renault 3.5 champion and McLaren Young Driver Programme member Kevin Magnussen. Pérez moved to Force India, where he was joined by Nico Hülkenberg, who returned to the team after one year with Sauber. As a result of the Hülkenberg and Pérez deals, Paul di Resta and Adrian Sutil lost their seats with the team. Sutil went on to secure Hülkenberg's vacant seat at Sauber, while di Resta left Formula One entirely and returned to the DTM series, the series he competed in prior to joining Formula One.",
            "Kamui Kobayashi returned to Formula One with Caterham, after spending the 2013 season competing in the World Endurance Championship. He was partnered with GP2 Series regular Marcus Ericsson, who became the first Swedish driver in Formula One since Stefan Johansson retired from the sport in 1991. The decision left both Giedo van der Garde and Charles Pic without a drive, and both went on to take reserve driver roles with other teams; van der Garde joined Sauber, while Pic moved to Lotus.",
            "Susie Wolff joined Williams as a test and reserve driver, with a programme that included participation in selected Free Practice 1 sessions. In doing so, she became the first female driver to take part in a Grand Prix weekend since Giovanna Amati failed to qualify for the 1992 Brazilian Grand Prix.",
            "Mid-season changes[edit]",
            ".mw-parser-output .tmulti .multiimageinner{display:flex;flex-direction:column}.mw-parser-output .tmulti .trow{display:flex;flex-direction:row;clear:left;flex-wrap:wrap;width:100%;box-sizing:border-box}.mw-parser-output .tmulti .tsingle{margin:1px;float:left}.mw-parser-output .tmulti .theader{clear:both;font-weight:bold;text-align:center;align-self:center;background-color:transparent;width:100%}.mw-parser-output .tmulti .thumbcaption{background-color:transparent}.mw-parser-output .tmulti .text-align-left{text-align:left}.mw-parser-output .tmulti .text-align-right{text-align:right}.mw-parser-output .tmulti .text-align-center{text-align:center}@media all and (max-width:720px){.mw-parser-output .tmulti .thumbinner{width:100%!important;box-sizing:border-box;max-width:none!important;align-items:center}.mw-parser-output .tmulti .trow{justify-content:center}.mw-parser-output .tmulti .tsingle{float:none!important;max-width:100%!important;box-sizing:border-box;text-align:center}.mw-parser-output .tmulti .tsingle .thumbcaption{text-align:left}.mw-parser-output .tmulti .trow>.thumbcaption{text-align:center}}",
            "Caterham (top) and Marussia (bottom)—both seen here at the Singapore Grand Prix—went into administration late in the season.",
            "In the week before the British Grand Prix, Caterham announced that team owner Tony Fernandes had sold his controlling stake in the team to a group of Swiss and Dubai-based investors. Former Midland and Spyker driver Christijan Albers was appointed as team principal, with the team declaring its intentions to continue competing under the Caterham name. Albers was himself replaced by Manfredi Ravetto, who admitted that the sale was necessary to keep the team on the grid. Ravetto was in turn replaced, this time by Finbarr O'Connell, who was appointed when the team was placed into administration ahead of the United States Grand Prix due to a dispute over the team's ownership. The team was later given a dispensation to miss the United States and Brazilian Grands Prix in order to resolve the dispute.",
            "Three-time 24 Hours of Le Mans winner and 2011 Formula Nippon (now Super Formula) champion André Lotterer made his Formula One debut with Caterham, replacing Kamui Kobayashi at the Belgian Grand Prix. Under the terms of the deal, Kobayashi returned to the team for the Italian Grand Prix, while Lotterer returned to Super Formula. The team had further planned to substitute Kobayashi for Formula One's most experienced driver in history, Rubens Barrichello, in the United States, Brazilian and Abu Dhabi Grands Prix, but were forced to abandon the plan when they entered administration. The team ultimately put together a rescue package ahead of the Abu Dhabi Grand Prix, but with Marcus Ericsson formally leaving the team ahead of a move to Sauber in 2015, Caterham chose debutant Will Stevens as his replacement.",
            "Alexander Rossi was entered for the Belgian Grand Prix by Marussia as a replacement for Max Chilton. However, following the first practice session, Chilton was reinstated as the team's racing driver, and Rossi only participated in the practice session. Rossi was later nominated as Jules Bianchi's replacement for the Russian Grand Prix, but the entry was ultimately withdrawn out of respect for the critically injured Bianchi.",
            "Jules Bianchi suffered a serious head injury in a crash at the Japanese Grand Prix, remaining hospitalised and in a coma until his death in July 2015. Marussia decided to withdraw their second entry for the Russian Grand Prix, Alexander Rossi, out of respect for the Frenchman. Faced with their own financial problems, the team was also granted a dispensation to miss the United States Grand Prix. One week before the Grand Prix, Marussia followed Caterham into administration."
        ]
    },
    "2015": {
        "Driver changes": [
            "Sebastian Vettel (pictured in 2012) left Red Bull Racing – the team with which he won four World Drivers' Championships – at the end of the 2014 season to join Ferrari.",
            "The driver line-ups saw a couple of changes prior to the 2015 season and one more prior to the Singapore Grand Prix. 2005 and 2006 World Champion Fernando Alonso replaced Kevin Magnussen at McLaren, returning to the team after he last raced for them in 2007. Following an accident during pre-season testing, Alonso withdrew from the season-opening Australian Grand Prix, and Magnussen returned as his temporary replacement. Sebastian Vettel left Red Bull Racing at the end of the 2014 season after six years with the team and nine years with its wider junior development programme to join Ferrari in place of Alonso. Daniil Kvyat was promoted to Red Bull from Toro Rosso to fill the vacated seat.",
            "Toro Rosso changed their entire line-up: along with Kvyat joining Red Bull, the team chose not to renew Jean-Éric Vergne's contract. Vergne went on to compete in the Formula E Championship while also becoming a Ferrari development driver. They were replaced by the 2014 Formula Renault 3.5 Series champion Carlos Sainz Jr. and the 2014 FIA Formula 3 European Championship third-place finisher Max Verstappen. The latter became the youngest driver to make a Formula One début, at the age of 17 years, 164 days when he started the season.",
            "Esteban Gutiérrez and Adrian Sutil were released from Sauber, where they were replaced by the former Caterham driver Marcus Ericsson and the GP2 driver Felipe Nasr. Gutiérrez and Sutil went on to join Ferrari and Williams respectively as reserve drivers.",
            "Manor Marussia also had two new drivers: They employed the former Caterham driver Will Stevens to drive for his first full season in the sport, while another former Caterham test driver, Roberto Merhi, was signed to a short-term deal while he also drove in the Formula Renault 3.5 Series. Max Chilton relinquished his seat, joining the Indy Lights championship, while Jules Bianchi was in a coma at the start of the season and ultimately died from injuries sustained at the 2014 Japanese Grand Prix. Alexander Rossi was later drafted in by Manor Marussia to make his Formula One début at the Singapore Grand Prix, replacing Merhi. The Spaniard returned to the team for the Russian and Abu Dhabi Grands Prix, sharing the car with Rossi for the remainder of the season.",
            "Kamui Kobayashi went on to race in the Super Formula series in Japan after the folding of Caterham left him without a drive in Formula One."
        ]
    },
    "2016": {
        "Driver changes": [
            "Jolyon Palmer, Rio Haryanto, Pascal Wehrlein, and Esteban Ocon made their Formula One debuts in 2016, Palmer with Renault, and the latter three with Manor. Haryanto was terminated after 12 round due to sponsor issues.",
            "The driver line-ups saw a couple of changes prior to the 2016 season and three more while the season was underway. Romain Grosjean left Lotus at the end of the 2015 season. He signed with the newly formed Haas F1 Team for 2016, where he was joined by former Sauber driver Esteban Gutiérrez. Gutiérrez returned to competition after spending a season as Ferrari's test and reserve driver.",
            "After having taken over the Lotus team, Renault introduced a new driver-line up. Jolyon Palmer, the 2014 GP2 Series champion, made his race debut in Melbourne. Palmer had previously made regular free practice appearances with the team when it was known as Lotus in 2015. Despite originally having signed a contract with Lotus for 2016, Pastor Maldonado announced he would not be driving for Renault after his sponsors were unable to fulfil their contractual obligations to the team. He was replaced by Kevin Magnussen, who was released by McLaren when they chose not to renew his contract after he entered a single race for the team in 2015.",
            "Manor did not retain their 2015 drivers either, opting to sign two rookies for its 2016 campaign: reigning Deutsche Tourenwagen Masters champion Pascal Wehrlein and GP2 Series regular Rio Haryanto, who became the first Indonesian driver to race in the championship. Will Stevens and Roberto Merhi—who drove for the team when it competed as Marussia—were not retained by the team. Both moved to the FIA World Endurance Championship with Manor Motorsport,[N 3] while Alexander Rossi, who also raced for the team in 2015, was moved to a test and reserve role while he joined the IndyCar Series.",
            "Mid-season changes[edit]",
            "After suffering broken ribs and a pneumothorax injury as a result of an accident during the Australian Grand Prix, Fernando Alonso was ruled out of the Bahrain Grand Prix as a precaution after medical exams. McLaren reserve driver and reigning GP2 Series champion Stoffel Vandoorne made his Formula One debut, replacing Alonso. Alonso returned to his seat for the Chinese Grand Prix two weeks later. Daniil Kvyat and Max Verstappen traded places ahead of the Spanish Grand Prix, with Verstappen promoted to Red Bull Racing and Kvyat returning to Scuderia Toro Rosso. Red Bull explained the decision to swap their drivers as being made to relieve pressure on Kvyat following criticism for his role in a first-lap accident in the Russian Grand Prix, and to ease ongoing tension between Verstappen and teammate Carlos Sainz Jr. at Toro Rosso. Rio Haryanto lost his race seat after the German Grand Prix, when his sponsors were unable to meet their financial obligations to the team. He stayed with the team, filling a testing and reserve role. His race seat was filled by 2015 GP3 Series champion and Renault test driver Esteban Ocon, who made his Formula One debut with MRT at the Belgian Grand Prix."
        ]
    },
    "2017": {
        "Driver changes": [
            "Nico Rosberg (pictured left) retired from Formula One shortly after winning the 2016 World Drivers' Championship. His place at Mercedes was taken by Valtteri Bottas (right).",
            "Kevin Magnussen turned down an offer to stay with Renault and instead signed a deal with Haas to drive alongside Romain Grosjean. As a result of the agreement with Magnussen and the team's decision to take up an option on Grosjean, Esteban Gutiérrez's contract with the team was not renewed. Gutiérrez later moved to the Formula E championship.",
            "Esteban Ocon moved from MRT to Force India, filling the seat left vacant by Nico Hülkenberg's departure to Renault.",
            "Reigning champion and Mercedes driver Nico Rosberg announced his shock retirement from the sport at the end of the 2016 season, ending his Formula One career after 11 seasons when he clinched the title in Abu Dhabi. Valtteri Bottas was released by Williams to sign with Mercedes as Rosberg's replacement. Felipe Massa, who had intended to retire from Formula One at the end of the 2016 season, extended his contract with Williams by a year to replace his former teammate. Massa was partnered by 2016 European Formula 3 Championship winner Lance Stroll, who was originally hired by the team to replace Massa.",
            "2015 GP2 Series champion Stoffel Vandoorne joined McLaren as a full-time driver. Vandoorne previously competed in one race for the team, substituting for the injured Fernando Alonso at the 2016 Bahrain Grand Prix. Vandoorne replaced Jenson Button, who took a sabbatical from racing in 2017 while staying on with the team as a reserve driver.",
            "Pascal Wehrlein moved from the now-defunct MRT to replace Felipe Nasr at Sauber.",
            "Rio Haryanto was under contract to compete in 2017, but his contract was terminated after the 2016 German Grand Prix due to sponsorship issues.",
            "Mid-season changes[edit]",
            "Sauber driver Pascal Wehrlein withdrew from the Australian Grand Prix as a precaution after an injury at the Race of Champions interrupted his training regimen, prompting concerns that he would not be able to cope with the greater physical demands placed on the drivers by the 2017 generation of cars. As such, 2016 GP2 Series runner-up Antonio Giovinazzi took over racing duties for Sauber. Wehrlein returned to competition at the Bahrain Grand Prix, with Giovinazzi resuming testing and reserve driving duties.",
            "Fernando Alonso did not contest the Monaco Grand Prix. Instead, he participated in the Indianapolis 500. Jenson Button, who was serving as team ambassador and reserve driver, replaced Alonso for the race.",
            "Paul di Resta replaced Felipe Massa for the Hungarian Grand Prix after Massa was taken ill after Free Practice.",
            "Jolyon Palmer was dropped by Renault after the Japanese Grand Prix. Carlos Sainz Jr., who was set to join Renault from 2018, left Toro Rosso early to replace him.",
            "In the final rounds of the championship, Toro Rosso rotated several drivers between their cars. Prior to the Malaysian Grand Prix, Daniil Kvyat was replaced by 2016 GP2 Series champion Pierre Gasly. After Sainz Jr. left the team for Renault, Kvyat returned as his replacement for the United States Grand Prix. Gasly was forced to miss this race as it clashed with the final round of his Super Formula Championship campaign. FIA World Endurance Championship driver and former Red Bull Junior Team member Brendon Hartley stood in for him. After the race, Kvyat was released from the team and from the Red Bull programme entirely, with Gasly returning to the team at the next race and Hartley being promoted to a regular race seat."
        ]
    },
    "2018": {
        "Driver changes": [
            "Charles Leclerc (left) and Sergey Sirotkin (right) made their Formula One débuts with Sauber and Williams respectively.",
            "Toro Rosso signed 2016 GP2 Series champion Pierre Gasly and two-time World Endurance champion Brendon Hartley as their full-time drivers for 2018. Both Gasly and Hartley made their Formula One debuts with the team in the latter stages of the 2017 championship. Daniil Kvyat left the team and the Red Bull driver programme, securing a development role with Ferrari.",
            "Charles Leclerc, the reigning Formula 2 champion, made his competitive début with Sauber. Leclerc, who had previously driven in Friday practice sessions in 2016 and 2017, was hired by the team to replace Pascal Wehrlein. Wehrlein was ultimately unable to secure a race seat and was instead enlisted as one of Mercedes's test and reserve drivers while racing full-time in the Deutsche Tourenwagen Masters series.",
            "Williams driver Felipe Massa retired from Formula One at the end of the 2017 championship. Massa was replaced by former Renault test driver and SMP Racing driver Sergey Sirotkin, who made his competitive début with the team."
        ]
    },
    "2019": {
        "Driver changes": [
            "Alexander Albon (left), Lando Norris (center) and George Russell (right) made their Formula One debuts with Toro Rosso, McLaren and Williams respectively.",
            "The lead up to the 2019 championship saw several driver changes. Daniel Ricciardo moved to Renault after five years with Red Bull Racing, replacing Carlos Sainz Jr. Ricciardo's drive at Red Bull Racing was taken by Pierre Gasly, who was promoted from Scuderia Toro Rosso, the team with whom he made his first Formula One start in 2017. Daniil Kvyat rejoined Toro Rosso after last racing for the team in 2017. He was partnered with Formula 2 driver Alexander Albon, who replaced Brendon Hartley. Albon subsequently became only the second Thai driver to race in Formula One after Prince Bira.",
            "Sainz, who was on loan to Renault in 2018, did not have his deal with Red Bull renewed and subsequently moved to McLaren to replace two-time World Drivers' Champion Fernando Alonso, who had earlier announced that he would retire from Formula One in 2019.  Sainz was partnered with 2017 European Formula 3 champion and Formula 2 runner-up Lando Norris, who replaced Stoffel Vandoorne, who would move to Formula E to race with the Mercedes-affiliated HWA Racelab, as well as join Mercedes as a reserve driver.",
            "Charles Leclerc left Alfa Romeo Racing after one year with the team, replacing 2007 World Champion Kimi Räikkönen at Ferrari. Räikkönen returned to Alfa Romeo, previously named Sauber, with whom he had started his career in 2001. He was partnered with Antonio Giovinazzi, who made two starts for Sauber when he replaced the injured Pascal Wehrlein in 2017. Marcus Ericsson moved to race in the IndyCar Series in 2019 with Schmidt Peterson Motorsports but remained with Alfa Romeo as a third driver and brand ambassador.",
            "Lance Stroll would join the Racing Point UK F1 team, replacing Esteban Ocon, who joined Mercedes as a reserve driver. Ocon shared the role of simulator driver with Stoffel Vandoorne. Reigning Formula 2 champion and Mercedes junior George Russell joined Williams replacing Stroll. Sergey Sirotkin would depart Williams due to his backer deciding to stop sponsoring Williams due to the lack of performance and development of the car. Sirotkin returned to Renault as a reserve driver. He would be replaced by Robert Kubica; Kubica's return comes after an eight-year absence brought on by a near-fatal rally car crash in 2011 that left him with serious arm injuries.",
            "Mid-season changes[edit]",
            "In the build-up to the Belgian Grand Prix, Red Bull Racing announced that Pierre Gasly would be demoted to Toro Rosso and Alexander Albon would be promoted in his place so that his performance would be evaluated in view of the team's 2020 line-up. The decision to release Gasly was criticised as he had completed just twelve races with the team, while Albon and Toro Rosso team-mate Daniil Kvyat had both previously been released from contracts with the Red Bull Junior Team and Red Bull Racing respectively."
        ]
    },
    "2020": {
        "Driver changes": [
            "After a year's absence, Esteban Ocon returned to racing in Formula One after signing a contract with Renault, replacing Nico Hülkenberg. Robert Kubica left Williams at the end of the 2019 championship and joined Alfa Romeo Racing as a reserve driver. Nicholas Latifi, the 2019 Formula 2 Championship runner-up, replaced Kubica at Williams.",
            "Mid-season changes[edit]",
            "George Russell (left) substituted for Lewis Hamilton (centre) at Mercedes  for the Sakhir Grand Prix after the latter tested positive for COVID-19. Jack Aitken (right) then substituted for Russell at Williams.",
            "A day before the British Grand Prix weekend, Racing Point driver Sergio Pérez tested positive for COVID-19 and was ruled out of the race weekend. After seeking clarification from Public Health England, Racing Point stated that they intended to let Pérez race in the 70th Anniversary Grand Prix pending a negative coronavirus test. This re-test came back positive and so Pérez was also unable to take part in the 70th Anniversary Grand Prix. He was replaced for both races by Nico Hülkenberg, who had raced for the team's predecessor Force India in 2012 and from 2014 to 2016, and last raced in Formula One at the 2019 Abu Dhabi Grand Prix. Pérez had a negative coronavirus test result the week preceding the Spanish Grand Prix weekend and he competed in the Grand Prix having been cleared by the FIA to return. Pérez's Racing Point teammate Lance Stroll felt ill prior to the Eifel Grand Prix and tested positive for the coronavirus on the day of the race. Hülkenberg again raced for the team.",
            "After Romain Grosjean suffered burns to his hands following a crash at the Bahrain Grand Prix, Haas promoted test driver Pietro Fittipaldi to make his debut at the Sakhir Grand Prix. Grosjean also missed the Abu Dhabi Grand Prix because of his recovery after the crash in Bahrain; Fittipaldi raced again for the team. Lewis Hamilton tested positive for the coronavirus prior to the Sakhir Grand Prix and was forced to sit out. He was replaced by George Russell, with Jack Aitken replacing Russell at Williams. Hamilton returned to Mercedes for the season-ending Abu Dhabi Grand Prix, after testing negative for the coronavirus, with Russell returning to Williams."
        ]
    },
    "2021": {
        "Driver changes": [
            "Mick Schumacher made his Formula One debut with Haas.",
            "Four-time World Drivers' Champion Sebastian Vettel left Ferrari at the end of the 2020 season after racing with the team for six seasons. Vettel's seat was taken by Carlos Sainz Jr., who had left McLaren after two seasons. Daniel Ricciardo moved from Renault to McLaren, where he replaced Sainz. Ricciardo was replaced by double World Champion Fernando Alonso, who drove in Alpine's first season, having last raced in 2018 for McLaren.",
            "Vettel moved to Aston Martin, where he replaced Sergio Pérez. Pérez, who had previously signed a contract to drive for Aston Martin's predecessor, Racing Point, until 2022, moved to Red Bull Racing where he replaced Alexander Albon, who was Red Bull Racing's reserve and test driver for the 2021 season. Pérez became the first driver since Mark Webber in 2007 to join the team without being previously a Red Bull Junior Team member.",
            "Romain Grosjean and Kevin Magnussen, who had raced for Haas since 2016 and 2017 respectively, left the team at the end of 2020. 2020 Formula 2 Champion Mick Schumacher, the son of seven-time World Champion Michael Schumacher, took one of the seats at the team while the other was filled by Nikita Mazepin, who finished fifth in the Formula 2 Championship.",
            "Yuki Tsunoda, who finished third in 2020 Formula 2 Championship, graduated to Formula One with Scuderia AlphaTauri, replacing Daniil Kvyat, who moved to Alpine as their reserve driver. Tsunoda became the first Japanese Formula One driver since Kamui Kobayashi in 2014.",
            "Mid-season changes",
            "During the Dutch Grand Prix weekend, Kimi Räikkönen tested positive for coronavirus. He was replaced at Alfa Romeo Racing by reserve driver Robert Kubica, who last raced at the 2019 Abu Dhabi Grand Prix, driving for Williams. Räikkönen was also replaced by Kubica at the subsequent Italian Grand Prix.",
            "Nikita Mazepin tested positive for coronavirus during the Abu Dhabi Grand Prix weekend, he was not replaced by Haas."
        ]
    },
    "2022": {
        "Driver changes": [
            "Zhou Guanyu (left) made his Formula One debut driving for Alfa Romeo. Nikita Mazepin (centre), who was originally going to compete for Haas, had his contract terminated amidst the Russian invasion of Ukraine. Mazepin was subsequently replaced by Kevin Magnussen (right).",
            "Fernando Alonso (left) broke Kimi Räikkönen's (right) record for the most race starts and race entries at the Singapore and Japanese Grands Prix, respectively.",
            "Kimi Räikkönen retired following the conclusion of the 2021 championship; Räikkönen won 21 races, and the 2007 World Drivers' Championship across a 19 season Formula career. Räikkönen's seat at Alfa Romeo was filled by Valtteri Bottas, who left Mercedes after 5 seasons. George Russell replaced Bottas, vacating the seat that he had held for the past 3 seasons at Williams. Russell was replaced by former Red Bull Racing driver Alex Albon.",
            "Zhou Guanyu, who finished third in the 2021 Formula 2 Championship, joined Alfa Romeo, in place of Antonio Giovinazzi, who had been at the team since 2019. Zhou became the first Chinese driver to compete in Formula One.",
            "Nikita Mazepin was originally contracted to compete for Haas, as part of a multi-year contract that started in 2021. Following the Russian invasion of Ukraine and the resultant cancellation of Uralkali's title sponsorship of Haas, his contract was terminated. He was replaced by Kevin Magnussen, who had last competed in 2020 with the same team.",
            "Mid-season changes[edit]",
            "Ahead of the Bahrain Grand Prix, Sebastian Vettel tested positive for coronavirus. He was replaced at the event, and the subsequent Saudi Arabian Grand Prix by Aston Martin by reserve driver Nico Hülkenberg, who last raced at the 2020 Eifel Grand Prix, driving for former team Racing Point.",
            "During the Italian Grand Prix weekend, Alex Albon suffered from appendicitis. He was replaced at Williams by the Mercedes reserve driver 2020–21 Formula E and 2019 Formula 2 Champion Nyck de Vries, who made his Formula One race debut."
        ]
    }
}