{
    "1990": {
        "Regulation changes": "None relevant"
    },
    "1991": {
        "Regulation changes": "None relevant"
    },
    "1992": {
        "Regulation changes": "None relevant"
    },
    "1993": {
        "Regulation changes": "None relevant"
    },
    "1994": {
        "Regulation changes": "None relevant"
    },
    "1995": {
        "Regulation changes": "None relevant"
    },
    "1996": {
        "Regulation changes": "None relevant"
    },
    "1997": {
        "Regulation changes": "None relevant"
    },
    "1998": {
        "Regulation changes": "None relevant"
    },
    "1999": {
        "Regulation changes": "None relevant"
    },
    "2000": {
        "Regulation changes": [
            "To keep costs down, the V10 engine configuration was made fully mandatory in 2000 so that engine builders would not develop and experiment with other configurations but the V engine bank angle remained varied. The V10 configuration had been the most popular since the banning of turbocharged engines in 1989, and no other configuration had been used since 1998.",
            "A change to red flag procedure was introduced, where races stopped after two laps but before three-quarters race distance had been completed would be restarted with the cars lining up on the grid in the order they were at the end of the penultimate lap before the lap during which the red flag was shown. Only the race order and number of laps completed were taken into account for the restarted race, with time differences between the cars voided; as such, the distance of the restarted race became the number of laps remaining from the original races, deducted by three.",
            "On 7 September, the FIA announced that using cooled fuel during a Grand Prix would be banned \"with immediate effect\".",
            "This was the last full season for cars competing without traction control, launch control, and fully-automatic gearboxes, until the 2004 and 2008 seasons, respectively. (Note: Traction control was reintroduced five races into the 2001 season, at the Spanish Grand Prix.)"
        ]
    },
    "2001": {
        "Regulation changes": "None relevant"
    },
    "2002": {
        "Regulation changes": "None relevant"
    },
    "2003": {
        "Regulation changes": "None relevant"
    },
    "2004": {
        "Regulation changes": [
            "From the 2004 season onward, all the teams that did not finish in the top four in the previous year's Constructors' Championship were allowed to run a third car in the Friday practice session before each Grand Prix, for testing purposes. While other teams were permitted to have test drivers, they were not allowed to compete in the Friday practice. Sauber chose not to run its third driver in these sessions because of the added expense.",
            "The 2004 season also saw a change in technical regulations, including banning fully-automatic gearboxes and launch control,  both of which had been used for the past three seasons. 2004 was the first time since the beginning of 2001 (pre-Spanish Grand Prix) that cars competed without these systems. However, the use of traction control was still permitted by the FIA, and continued to be allowed for use over the next three seasons, until it was banned for the 2008 season."
        ]
    },
    "2005": {
        "Regulation changes": [
            "For a time there existed a distinct possibility that some teams would be running three race cars per Grand Prix: fewer than 10 teams, or 20 cars, starting on the grid would have resulted in some teams running three cars, under a term in the Concorde Agreement. By the first round of the season, there were ten teams, as Red Bull completed their takeover of Jaguar and were ready to race in Australia. Minardi, which initially received an injunction allowing them to compete despite their cars' non-conformity to new 2005 technical regulations, later modified their cars to adhere to 2005 regulations.",
            "Technical regulations[edit]",
            "A major change in 2005 was the outlawing of tyre changes during pit stops. Now a driver had to use one set of tyres during qualifying and the race itself. The reason for this rule change was to motivate the teams to select harder tyre compounds with less grip, reducing cornering speeds, which was intended to improve safety. Tyre changes were allowed for punctures and for wet weather, under the direction of the FIA. The FIA had to post a \"change in climatic conditions\" notice in order for tyre changes to occur normally as a force majeure. After Kimi Räikkönen's disastrous accident at the Nurburgring when his suspension collapsed after a flat-spotted tyre ripped the carbon fibre suspension apart, team principals and the FIA agreed that a single tyre change per car could be made without penalty, provided it was to change a tyre that had become dangerously worn like Räikkönen's had. Preserving a single set of tyres for the entire race became a new challenge for drivers; the challenge for tyre manufactures was to produce more durable, long-lasting compounds. Michelin-shod runners had a distinct advantage over their Bridgestone counterparts.",
            "Formula One engines had to last two race weekends, double that demanded by 2004 regulations. A driver who needed to change an engine was subject to a 10-place grid penalty for the race. Designed to limit revs and power outputs demanded by greater reliability, this regulation was also a cost-cutting measure for engine manufacturers.  After the initial race of the season, the FIA acted to close a loophole in this new regulation exposed by BAR, who deliberately pitted their cars rather than finish the race.",
            "The technical aerodynamics regulations were modified to improve competition, especially for cars travelling in another car's air flow wake in order to overtake.  By changing the size and placement of both front and rear wings, as well as requiring higher noses, the new rules attempted to reduce downforce by roughly one-quarter, but teams developed other chassis innovations to reclaim much of that \"lost\" downforce, which made following another car even harder than the previous season. Front wings have been lifted by 5 cm (50 mm), to reduce downforce, while the rear wings have been brought forward 15 cm (150 mm) relative to the centre line between the rear wheels.",
            "This was the final season in which the 3.0-litre V10 engine configuration was used by all teams. New changes in the technical regulations saw a 2.4-litre V8 engine configuration being introduced by the FIA for the 2006 Formula One season; however, the FIA granted an exemption for teams who were unable to re-engineer or could not afford a V8 engine in time for 2006. Budget or resource-limited teams were allowed to run a rev-limited 3.0-litre V10. Ten of the eleven teams ran with a conventional 2.4L V8 for 2006, with the exception of Scuderia Toro Rosso, who continued and were permitted by the FIA to use a rev-limited Cosworth TJ2006 3.0L V10 powerplant.",
            "Sporting regulations[edit]",
            "The first six races of the 2005 season used a new qualifying format, marking the third year in five with sharply revised qualifying rules. Grid position was determined by aggregate times from two single-lap flying runs, one Saturday afternoon and one Sunday morning. Refueling was allowed after the first qualifying run Saturday; however, the car must have been fuelled for the race for Sunday's qualifying.  (Although some rules changes are brought about to even the playing field or to reduce costs, this rule change was prompted by the typhoon which rescheduled qualifying for the 2004 Japanese Grand Prix).  Adverse weather conditions affecting either qualifying session impacted the final, aggregate time. On 24 May, the ten team bosses met with Max Mosley and recommended a return to a single, one-lap qualifying run on Saturday on race fuel and race tyres, which, having been approved by the FIA World Motor Sport Council, took effect at the European Grand Prix on 29 May.",
            "If a driver stalled his car while entering the final grid, the other cars were sent instantly to a new warm-up lap, instead of all drivers stopping their cars and waiting a couple of minutes for a new start. The stalled car is pushed to the pit lane and the grid is clear when the drivers return.",
            "When the race was red-flagged, the timekeeping system would not stop. The drivers would stop on the start/finish straight, and the restart would take place behind the safety car instead of a standing start which was used earlier. Although this rule came in effect in 2005, it was first used at the 2007 European Grand Prix.",
            "Also in safety car situations, the rules were changed to allow the safety car to use the pit lane if necessary. This rule change was made following Ralf Schumacher's accident in 2004 United States Grand Prix."
        ]
    },
    "2006": {
        "Regulation changes": [
            "Technical regulations[edit]",
            "In an attempt to curb the increasing engine power levels of recent years, the maximum engine displacement was reduced from 3.0 to 2.4 litres and the number of cylinders from 10 to 8. At similar engine speeds, the change was expected to cut peak power by around 200 bhp, which would equate to around three to five seconds on lap times at most circuits. (Scuderia Toro Rosso continued to use 3.0-litre 10-cylinder engines with both rev and air-intake limiters to avoid the costs of re-engineering their cars in a short period). Initial testing indicated the new engines were six seconds slower than their V10 counterparts, but early in the season, it became obvious that despite the decrease in power, lap times were not far from 2005 figures; on some circuits, the fastest laps set this year were actually faster than the ones recorded last year, with the V10 engines.",
            "Some engine suppliers indicated early that their smaller V8s can rev higher than the 19,000 rpms normal for 2005-spec V10s. Northampton-based engine builder Cosworth had an enviable record of success with V8 engines. It made further history by becoming the first manufacturer to have broken the 20,000 rpm limit on track in December 2005.",
            "Tyre changes returned to Formula One in 2006. Each driver is limited to 14 sets of tyres per race weekend. This consists of seven sets of dry-weather tyres, four sets of wet-weather tyres and three sets of extreme-weather tyres. The thinking behind this is that the reduced engine size will offset any performance gain. The number of constructors who were supplied tyres by Michelin was down from seven to six while Bridgestone increased from three to five. Michelin announced they would withdraw from the championship after the 2006 season.",
            "All Formula One cars and entrants began to utilise mandatory 7-speed + 1 reverse semi-automatic gearbox configuration from 2006 to 2013.",
            "To keep costs down, the fuel tank capacity of all Formula One cars were mandatorily standardized to 150 litres (40 US gallons).",
            "Sporting regulations[edit]",
            "A new qualifying system consisting of three sessions of varying length was introduced. A 15-minute session was held first, in which the six slowest cars from that session were eliminated and thus set in grid positions 17–22. After a five-minute break, another 15-minute session was held with the remaining cars, and again the six slowest cars were eliminated and set in positions 11–16. These twelve eliminated drivers were placed in parc fermé, but allowed to modify fuel loads as they see fit.",
            "During a further five-minute break, the remaining 10 cars declared their fuel loads to the FIA. A final 20 minute session then decided the top 10 grid positions. Teams were allowed to run their fuel load low by making as many laps as possible, and thus improve their times as the weight falls. This was considered an improvement for TV audiences because teams needed to run as many laps as possible to lower their fuel loads. Following this session, the top ten cars were placed in parc ferme and required to refill their fuel load to the level of that at the beginning of the final 20 minutes. Starting with the 2006 French Grand Prix, qualifying for final session was cut short to just 15 minutes, making all of the sessions the same length, and the ability for drivers to complete a flying lap after the chequered flag drop now applied in the first two sessions as well.",
            "A loophole was detected by the FIA, in that teams could declare a large fuel load but on the out lap \"leak\", or use a large quantity of fuel to lighten a car and permit a faster lap. The FIA decided to only count laps that are within 110% of the driver's fastest time, and allow teams to top up with the amount of fuel used for those laps.",
            "Only one free practice session was held on Saturdays, for one hour, and it ended no less than two hours before qualifying begins, usually between 11.00 and 12.00, replacing the old system of two 45-minute sessions. Friday remained unchanged, with two one-hour sessions, starting three hours apart.",
            "The tuned mass damper system was used by several teams, notably Renault, during the latter part of 2005 and the 2006 seasons. The devices were located in the nosecone, and were particularly effective in corners and over kerbs to keep the tyres in closer contact to the track surface than they would otherwise be. After the French Grand Prix, the FIA announced that the system would be outlawed. This had a particularly significant effect on Renault, as the team had effectively built their cars around the devices, and had introduced them as long ago as the 2005 Brazilian Grand Prix. At the German Grand Prix the Renault team submitted one of their cars for scrutineering by the race stewards, who ruled that the devices were acceptable. The FIA launched an appeal against this decision, and on 23 August 2006 the FIA International Court of Appeal issued a statement upholding this appeal and rejecting the stewards' decision. The Court of Appeal stated that the system infringed part of the bodywork section (Article 3.15) of the Formula One Technical Regulations, which stated that any specific part of the car influencing its aerodynamic performance had to: comply with the rules relating to bodywork, be rigidly secured to the entirely sprung part of the car (rigidly secured means not having any degree of freedom), and remain immobile in relation to the sprung part of the car. The central argument was whether the mass dampers function as aerodynamic devices or as a part of the suspension system. The FIA reasoned that because the devices did not \"remain immobile in relation to the sprung part of the car\", they were illegal. But the FIA failed to explain how the damper, which was entirely enclosed with the car can be counted as bodywork when article 1.4 of the regulations defined bodywork as:",
            "All entirely sprung parts of the car in contact with the external air stream, except cameras and the parts definitely associated with the mechanical functioning of the engine, transmission and running gear. Airboxes, radiators and engine exhausts are considered to be part of the bodywork.",
            "Following the ruling by the Court of Appeal, the system was officially banned before the 2006 Turkish Grand Prix. In a later interview, Renault's Flavio Briatore named McLaren as the team who complained to the FIA."
        ]
    },
    "2007": {
        "Regulation changes": [
            "Although the FIA had planned to mandate a single regulation tyre manufacturer from 2008, Bridgestone was the sole supplier in 2007, after Michelin ended their participation in Formula One at the end of the 2006 season. Revised Sporting Regulations meant a total of 14 sets of dry weather tyres per driver would be available over each race weekend: four sets for Friday only, and 10 for the rest of the weekend. During the race both compounds of tyre (hard and soft) had to be used at least once. At the first round in Australia soft tyres were marked with a white spot. However, this was difficult to see when the car was in motion and from the second round in Malaysia onwards one of the four grooves in the soft compound tyre was painted white.",
            "Top: harder tyre (officially named the 'prime' tyre).Bottom: softer tyre (the 'option' tyre), at the Malaysian Grand Prix.",
            "The teams finishing 5th–11th in the previous season's Constructors' Championship were no longer allowed to run a third car on Friday following a rule change. The teams that finish 1st–4th were already banned from doing so.",
            "Engine development was frozen from the 2006 Japanese Grand Prix, with these engines being used for the whole of 2007 and 2008. This was described as engine \"homologation\" by the FIA. It was previously set to be introduced in 2008.",
            "All cars were fitted with red, blue and yellow cockpit lights. The purpose was to give drivers information concerning track signals or conditions. The lights had to be LEDs each with a minimum diameter of 5 mm and which were fitted so as to be directly in the driver's normal line of sight.",
            "In order to give rescue crews an immediate indication of accident severity each car had to be fitted with a warning light which was connected to the FIA data logger. The light had to face upwards and be recessed into the top of the survival cell no more than 150 mm from the car centre line and the front of the cockpit opening and as near to the marshal neutral switch as is practical.",
            "The two Friday practice sessions were expanded from 60 minutes to 90 minutes. All teams were allowed to use two cars, which could be driven by either the two race drivers or a nominated third driver.",
            "The engine penalty was only applied in the second day of the Grand Prix weekend. Any engine change in the first day was not penalised.",
            "No car was allowed to enter the pits to refuel during a safety car period until all cars were in the group following the safety car and they were advised that the pit lane was open. This prevented drivers from racing to the pits immediately after a safety car was deployed. In addition, any lapped cars in front of a car on the lead lap were required to pass the safety car and restart at the end of the line-up instead of maintaining their physical position.",
            "The Formula One teams unanimously agreed to the voluntary early introduction of the testing agreement scheduled for 2008. This limited each team to an annual limit of 30,000 kilometres (19,000 mi).",
            "The team's second car had to run with a yellow coloured roll bar instead of a black one. The first cars continued running with a red/orange roll bar. This was intended to help spectators distinguish between first and second cars at further distances.",
            "As Scuderia Toro Rosso switched to Ferrari 056 engines, all Formula One entrants began using the mandated 2.4-litre V8 naturally-aspirated engines for the first time after one year the V10 engine was an option in 2006.",
            "Television coverage[edit]",
            "Formula One Management became the sole host broadcaster for all but three of the 17 Grands Prix in 2007.  All coverage was produced in anamorphic 16:9 widescreen for the first time.",
            "ITV Sport, Premiere, ORF1, RTL7, TF1, TV3 and Polsat were among the first broadcasters to provide a standard 16:9 widescreen programme at the opening race in Australia.",
            "For the United States TV coverage, except Speed Channel, FOX also broadcast four Formula One races.  Those were the Canadian Grand Prix, United States Grand Prix, French Grand Prix and British Grand Prix. The Canadian Grand Prix and United States Grand Prix were televised live.",
            "In Poland, F1 broadcast was moved into Polsat from TV4.",
            "In Portugal, SportTV became the broadcaster.",
            "Circuits[edit]",
            "A new chicane was inserted into the straight between Europcar and New Holland (final corner) at the Circuit de Catalunya, Barcelona. It was installed in order to slow the cars down before the long main straight, and with the intent that it would provide more overtaking opportunities into turn 1.",
            "Spa underwent track changes as well, with a new paddock area, a reprofiled Bus Stop Chicane, an extension of the start-finish straight and a change to La Source hairpin.",
            "The largest-scale repair in the last 35 years was done to Autódromo José Carlos Pace in São Paulo, Brazil, to fundamentally solve the problem of the asphalt. All present asphalt was removed and replaced with new asphalt. At the same time, the pit lane entrance was enhanced to improve safety. The circuit was closed and no event was held for five months to allow work, from June to October, until immediately before the event."
        ]
    },
    "2008": {
        "Regulation changes": [
            "A standard Electronic Control Unit was supplied by Microsoft MES, a joint venture between Microsoft and McLaren Electronic Systems.",
            "Traction control was banned along with engine braking reduction.",
            "An engine freeze to last five years was started in 2008, with the first unscheduled engine change of the season not leading to the usual 10 place grid penalty.",
            "Fuel of the cars must have been made up of at least 5.75% biological materials.",
            "Gearboxes were required to last four races, with a 5 place grid penalty for a gear box change. If a driver did not finish a race, he was allowed to change the gearbox for the next race without receiving a penalty.",
            "Cockpit protection was improved.",
            "The use of a spare car was restricted. Each competing team would not be allowed to have more than two cars available for use at any time. In this context, a car was considered as such if it was a partially assembled survival cell, fitted with an engine, any front suspension, bodywork, radiators, oil tanks or heat exchangers.",
            "Bridgestone would be the official tyre supplier for the 2008–2010 seasons. They would also be marking their extreme wet weather tyres with a white line in the central groove to differentiate it from the softer wet weather tyre compound.",
            "No competing team was allowed to carry out more than 30,000 km (18,641 mi) of testing during the 2008 calendar year.",
            "Qualifying[edit]",
            "The first part of qualifying was lengthened to 20 minutes, and the final part of qualifying shortened to 10 minutes. Teams taking part in Q3 would no longer be allowed to add fuel back to the car after qualifying: a change which was made in order to eliminate the 'fuel-burn' phase.",
            "A minimum lap time for each qualifying session was implemented from Round 3 in Bahrain in order to stop cars coasting back to the pits at dangerously low speeds, such as that seen in Round 2 in Malaysia. Both Lewis Hamilton and Heikki Kovalainen were demoted five grid places after the stewards decided that they had impeded Nick Heidfeld and Fernando Alonso. The minimum lap time was different for each race. For example, it was 1:39 in Bahrain.",
            "From 8 May 2008, the FIA announced that, following Super Aguri's departure from Formula One, the qualifying procedures changed. Rather than six drivers being eliminated at the end of Q1, only the five lowest-qualified drivers would be eliminated. This increased the likelihood that one of the midfield contenders would drop out, as only the top 15 drivers would go through to Q2. At the end of Q2 five rather than six cars would be eliminated as well."
        ]
    },
    "2009": {
        "Regulation changes": [
            "Banned since 1998, slick tyres were re-introduced for 2009.",
            "A ban on aerodynamic appendages resulted in the 2009 cars having smoother bodywork.",
            "The front wing was lower and wider than in 2008.",
            "The rear wing was higher and narrower.",
            "The FIA released preliminary technical regulations for the 2009 season on 22 December 2006, and these were revised several times to accommodate the findings of the Overtaking Working Group (formed in response to concerns that passing in wheel-to-wheel racing was becoming increasingly rare) and the increasing need for cost-cutting in the sport to minimise financial costs.",
            "Slick tyres returned for the first time since they were banned for the 1998 season. Bridgestone continued to be the sole supplier of tyres, and drivers still had to use both compounds of tyre during a race. Soft tyres were differentiated by a green marking around the sides of the tyres, rather than a white marking in a groove as used in 2008. Further, wet tyres were renamed \"intermediate\" and extreme-weather tyres were renamed \"wet\".",
            "The aerodynamic regulations were radically altered for the 2009 season. The front wings were made lower and wider, while rear wings were changed to be higher and narrower. As well as the changes in the dimensions of the wings, bodywork became much more regulated with many of the additional components seen in previous seasons (including barge boards, winglets and turning vanes) removed, making 2009 cars noticeably different in appearance than in previous years. The diffuser at the rear of the car was moved back and upwards. Many other minor chassis components were also standardised. The aim of the new aerodynamic regulations, as well as the reintroduction of slick tyres, was to decrease reliance on aerodynamic downforce and increase mechanical grip with the aim of making wheel-to-wheel racing easier.",
            "For the first time, cars were allowed to use driver adjustable bodywork, in the form of adjustable flaps in the front wing. The flaps could be adjusted by up to six degrees, limited to only two adjustments per lap. Adjustable front wings were designed to improve downforce when following another car, another change designed to improve overtaking.",
            "Kinetic Energy Recovery Systems, a regenerative braking device designed to recover some of the vehicle's kinetic energy normally dissipated as heat during braking, were introduced for the 2009 season. The recovered energy can be stored electrically, in a battery or supercapacitor, or mechanically, in a flywheel, for use as a source of additional accelerative power at the driver's discretion by way of a boost button on the steering wheel. The regulations limit the additional power to around 82 hp (61 kW) of 400kJ for six seconds a lap. The systems were not made compulsory, and because of concerns about both limited performance gains and safety implications only four teams opted to use the system during the season.",
            "While the FIA were planning on introducing a budget cap to limit the amount of spending by Formula One teams in 2008, the amount was not agreed upon and the budget cap idea was dropped. Instead, costs were brought down by a complete ban on in-season testing, a forced reduction in wind tunnel usage, the sharing of more data during race weekends, an increased minimum engine lifespan and gearboxes had to last for four races, and a penalty of five places in the starting grid was applied, should a driver change it during the weekend before the start of the race.",
            "Each driver was limited to a maximum of eight engines throughout the season, in addition to four engines for practice/testing purposes; using additional engines resulted in a 10-place grid penalty for each additional engine used. To aid improvements in reliability, the engines were detuned from 19,000 RPM to 18,000 rpm.",
            "The rule stating that the pit lane is closed during a safety car period was scrapped in 2009. The rule was introduced in 2007 to prevent drivers rushing back to the pits to refuel, possibly speeding through a danger zone, but software was successfully developed to solve this problem. The pit lane speed limit was also increased from 50 mph (80 km/h) to 62 mph (100 km/h).",
            "The FIA initially declared that the driver with the most wins at the end of the season would be the winner of the 2009 Formula One World Championship, but dropped the decision because of opposition from teams and drivers. Formula One Teams Association argued that FIA could not change the rules this close to the season's start without the full agreement of the teams. Other proposals rejected by FIA were the introduction of a new points system with the scale 12–9–7–5–4–3–2–1 and to award medals for first, second and third place."
        ]
    },
    "2010": {
        "Regulation changes": [
            "Refuelling during the race was abolished for the first season since 1993. Despite the resolution over the budget cap and the decision for 2010 to fall back to the 2009 rules, FOTA expressed interest in a refuelling ban as it represents a way to cut costs.",
            "The 2010 cars were 20–22 cm longer than the 2009 versions because of the larger fuel tank.",
            "To accommodate the extra teams, the maximum number of cars allowed to take part in a race increased from 24 to 26 cars. Formula One Management offered financial support to all new teams for 2010, in the form of $10m (£6.25m, €6.8m) along with the free transportation of two chassis and 10,000 kg (22,049 lbs) of freight to each race. The increased number of teams now requires garages to be allocated on an equal basis at each Grand Prix.",
            "Teams had to homologate certain parts of the car, including the driver's survival cell, roll structures, all impact structures and the front and rear wheels, meaning they couldn't be modified over the course of the season without written approval from the FIA on safety or reliability grounds. The minimum car weight increased from 605 kg to 620 kg (1,334 lbs to 1,367 lbs) to better accommodate heavier drivers with KERS units, despite FOTA's agreement not to use the system.",
            "The qualifying system changed to accommodate the extra cars: 7 cars drop out of the first qualifying session, 7 from the second session and 10 cars will challenge for pole position in the third session. The third session was to be run in a low-fuel configuration due to the refuelling ban, although these drivers must start the race on the set of tyres used in the third session. If a tyre is damaged in qualifying, then the FIA technical delegate will assess the extent of the damage and may allow the car to switch tyres to a set he deems to be safe.",
            "The front tyres changed from 270 mm (11 in) to 245 mm (9.6 in)",
            "Drivers were given eleven sets of tyres over the course of a weekend, reduced from the fourteen sets in 2009. Three of these sets were for practice only and were returned before the start of qualifying, regardless of whether they are used or not. The front tyres were narrowed from 270 mm (11 in) to 245 mm (9.6 in), in order to improve the balance of grip between the front and rear. Wheel covers and rim heaters were banned, and tyre blankets were only allowed to act on the tyre's outer surface.",
            "A new points system was ratified for 2010, in response to the increased grid. Since 2003, points had been awarded to the top eight finishers, on a 10–8–6–5–4–3–2–1. The 2010 system awarded the top ten classified finishers on a 25–18–15–12–10–8–6–4–2–1 basis.",
            "The stewarding system had a fixed pool of stewards to draw from for each race, including former racing drivers, instead of a rotating line-up. This was to make the stewarding process more transparent, following recent controversies involving the stewards. Previously, stewards were only able to issue twenty-five-second penalties for infractions that occurred too late in the race for drivers to receive a normal penalty, but for 2010 they had the power to hand out twenty-second penalties to drivers who would have received a drive-through penalty and thirty-second penalties to those who would have received a stop-and-go penalty. A penalty had to be completed within two laps of the issuing rather than the three of previous years now.",
            "Replacement drivers were permitted to one day of testing, provided they have not participated in an F1 race in the last two calendar years. This was in response to several drivers in 2009 competing in their début weekend with no experience of their F1 car. Teams are also allowed to run a replacement driver in the Friday practice sessions.",
            "Powered devices that lift any part of the car during the pit stop were banned, and to prevent teams from releasing a car into the path of an oncoming driver in pit lane, the crew had to wait until the oncoming driver that is within a 25 m (82 ft) zone either side of the pit box has passed.",
            "The Concorde Agreement, which governs Formula One, was renewed at the 2009 Hungarian Grand Prix. Several cost-cutting proposals were included, such as a limit on the number of aerodynamic upgrades permitted over the course of a season and restrictions on the number of team personnel who attend a Grand Prix weekend. Also included was a Provision that teams were now be able to miss as many as three races before being ejected from the championship, although the FIA was to impose some kind of penalty for a missed race.",
            "Whilst the race is suspended neither the race nor the timekeeping system will stop; however the length of the race suspension will be added to the maximum two hour period.",
            "Mid-season changes[edit]",
            "A new parc fermé system, trialled in Bahrain, had cars sealed inside a bag within the team garages and monitored by low-resolution cameras, switching to a high-definition output if it sensed movement within the garage. The system was made a permanent procedure for parc ferme from the Australian Grand Prix.",
            "Wing mirrors – previously treated as aerodynamic aids instead of for the drivers benefit – may no longer be mounted in the \"outboard\" position, following concerns about poor visibility which resulted in several cases of accidental blocking in Melbourne. The ban was effective from the Spanish Grand Prix onwards.",
            "Following the success of the Canadian Grand Prix, tyre supplier Bridgestone announced its intentions to increase the difference between its compounds for the German Grand Prix, meaning that the teams have to deal with the extremes in the rubber compounds.",
            "At the FIA World Motor Sport Council meeting in Geneva, on 23 June, the rules regarding safety car conditions were clarified following a final-lap incident involving Michael Schumacher and Fernando Alonso at the Monaco Grand Prix. No car may overtake until it has passed the first safety car line for the first time when the safety car is returning to the pits. However, if the safety car is still deployed at the beginning of the last lap, or is deployed during the last lap, it will enter the pit lane at the end of the lap and the cars will take the chequered flag as normal without overtaking.",
            "Any car being driven unnecessarily slowly, erratically, or which is deemed potentially dangerous to other drivers, will be reported to the stewards. This will apply whether any such car is being driven on the track, the pit entry or the pit lane. To avoid coming under the scrutiny of the stewards, a driver must return to the pits within a pre-determined lap time set by the stewards.",
            "If a sample of fuel is required after a practice session the car concerned must have first been driven back to the pits under its own power. This was a response to qualifying at the Canadian Grand Prix when Lewis Hamilton stopped on the circuit after his team informed him that he may not have enough fuel left in the tank for the sample to be taken after the session. Although no action was taken against Hamilton, the stewards moved to prevent teams from deliberately doing it in the future.",
            "Following a minor controversy when Ferrari conducted a \"filming day\" at Fiorano ahead of the European Grand Prix using a car that included parts to be debuted at the race – which some felt was an attempt to circumvent bans on testing – changes were made to the rulebook that mean teams will be banned from running parts that have not been raced at a filming session or media event.",
            "Ferrari and Red Bull were both accused of having front wings that flexed at high speed, pushing them closer to the ground than is allowed. Although no wing ever failed scrutineers' tests, as of the Belgian Grand Prix the test was made more stringent by increasing the load applied to the wings. Similar changes were made at the Italian Grand Prix to the test of the front section of the floor under the nose (known as the bib).",
            "Safety car[edit]",
            "The new Mercedes-Benz SLS AMG was introduced as the safety car for 2010.",
            "Following controversy at the European Grand Prix, the safety car rules were revised ahead of the British Grand Prix. In the event of a safety car deployment, drivers are given a \"delta time\" – 120% of a standard race lap (i.e. if the standard lap time is one minute, forty seconds, the delta time is two minutes) – a minimum lap time in which to get back to the pits or else be cited for speeding. However, following the Webber-Kovalainen crash in Valencia, several drivers were penalised for breaking the delta time as they had been racing ahead of the accident and the safety car was deployed as they approached the end of the lap; in effect, they had safely completed a lap at racing speeds and pitted at the earliest opportunity. Instead of following the delta time, drivers must slow down to the speed of the safety car from the moment it is deployed, but will be exempt from doing so for the final two hundred metres of the lap. As a result of this, it will prevent drivers from gaining an advantage by pitting at the earliest possible opportunity and emerging ahead of the safety car."
        ]
    },
    "2011": {
        "Regulation changes": "None relevant"
    },
    "2012": {
        "Regulation changes": "None relevant"
    },
    "2013": {
        "Regulation changes": "None relevant"
    },
    "2014": {
        "Regulation changes": [
            "Technical regulations[edit]",
            "Car aesthetics proved controversial in 2014, with the demand for a low nose resulting in teams designing cars with a finger-like appendage—seen here in the nose of the Caterham CT05—dubbed the \"alien\" at the front of the chassis.",
            "The 2014 season saw the introduction of a new engine formula, with turbocharged engines returning to the sport for the first time since 1988. The new engines were a 1.6-litre V6 format with an 8-speed semi-automatic gearbox. The traditional 2.4 litres (146 cubic inches) naturally-aspirated V8 engines that were used since 2006 (and later became mandatory for all entrants since 2007) until 2013 were permanently retired. The rules dictated the use of a ninety-degree engine bank, with fixed crankshaft and mounting points for the chassis, while the engines were limited to 15,000 rpm. Individual engine units under the 2014 specifications had to last for at least 4,000 km (2,500 mi) before being replaced, in comparison to the pre-2014 engines, which were required to last for just 2,000 km (1,200 mi). The engines, now known as \"power units\", were divided into six separate components: the internal combustion engine (ICE); turbocharger (TC); Motor Generator Unit-Kinetic (MGU-K), which harvested energy that would normally be wasted under braking; Motor Generator Unit-Heat (MGU-H), which collected energy in the form of heat as it was expelled through the exhaust; Energy Store (ES), which functioned as batteries, holding the energy gathered by the Motor Generator Units; and Control Electronics (CE), which included the Electronic Control Unit and software used to manage the entire power unit.",
            "Under the previous generation of engines, used from 2006 to 2013, engines were subject to a development \"freeze\", which prohibited manufacturers from upgrading their engines. Faced with the complexity of the 2014 engines, the engine freeze was replaced with a points-trading system to prevent manufacturers from being unable to develop or improve their engines. Under the system, the individual parts of the engine were classified as Tier 1, Tier 2 and Tier 3, and were assigned a points value there within. Engine manufacturers were given a budget of sixty-six points, which they were free to spend on engine development, with points deducted from their budget depending on the parts developed.",
            "The kinetic energy recovery system—known from 2009 to 2013 as KERS, and renamed from 2014 as ERS-K—was incorporated into the design of the engine and its usage increased; its function as a supplementary power source was taken by the introduction of the heat-based energy recovery system (ERS). The ERS unit captured waste heat as it was dispelled from the exhaust turbocharger, using an electrical device known as a heat motor generator unit. This waste heat was stored as an electrical charge until it was used by a complementary system called the kinetic motor generator unit. This device was connected directly to the drive train to deliver the additional power in the most direct and efficient way. In combination with the ERS-K it gave drivers an additional 161 bhp (120 kW) for thirty-three seconds per lap, compared to the KERS units used prior to 2014, which gave drivers 80 bhp (60 kW) for six seconds per lap. This energy was released into the powertrain by the electronic control unit (ECU) to promote the most efficient and effective application of the power, but the driver had the ability to manually override the ECU and use the remaining available power instantly.",
            "Teams were permitted to use electronic braking devices to manage the braking of the rear wheels as the increased power output from the ERS-K units made regulating the brake bias much harder than it had been previously.",
            "Teams were no longer allowed to change their gear ratios from race to race to suit the individual demands of a circuit. Instead, they had to nominate eight gear ratios ahead of the first race of the season, and these eight ratios were used at every Grand Prix. They were given one opportunity to change their ratios once the season had started, but any subsequent changes would have incurred a grid penalty.",
            "Lower noses returned for the first time since the 2010 season. The 2014 regulations required the use of lower noses than in previous years, in the interests of driver safety. The tip of the nose had to be no more than 185 mm (7.3 in) above the ground, in comparison to the 550 mm (22 in) allowed in 2012. These regulations were amended in June 2013 so as to completely outlaw the use of the \"stepped noses\" used in 2012 and 2013, thereby forcing teams to design a car with a genuinely lower nose rather than using the temporary solution.",
            "The original rules—first published in August 2011—also called for a variety of bodywork changes aimed at cutting downforce, most notably through the use of narrower front wings, and a shallower angle to the main plane of rear wings. These additional changes were formally abandoned in December 2012, but the requirement that cars be built with a nose no more than 185mm above the ground was retained. The planned reduction in front wing width from 1,800 mm (71 in) to 1,650 mm (65 in) was subsequently reintroduced.",
            "Teams were no longer able to use a beam wing at the rear of the car, a small carbon fibre wing mounted above the diffuser designed to generate low pressure as air passed over it, allowing them greater control over the air that was being deliberately directed over the diffuser.",
            "To promote fuel efficiency and limit horsepower levels seen in the 1980s, the last time Formula One used forced induction engines, fuel flow was restricted to 100 kg/h above 10,500 rpm; below 10,500 rpm a formula for the maximum flow was applied based on the rpm in use.",
            "Following Daniel Ricciardo's disqualification from the Australian Grand Prix for exceeding the fuel-flow limit, the FIA issued a Technical Directive preventing teams from making modifications to their fuel sensors after an investigation into the problem found that compounds in the bespoke fuel used by some teams were corroding a rubber seal in the sensor, leading to anomalous readings.",
            "The position of the exhaust outlet changed so that it was now angled upwards toward the rear wing instead of downwards to face the rear diffuser so as to make the practice of using exhaust blown diffusers—passing exhaust gasses over the rear diffuser to improve the car's downforce—extremely difficult to achieve.",
            "The minimum weight of the cars was increased from 642 kg (1,415 lb) to 691 kg (1,523 lb) to account for the increased weight of the engine, energy recovery units, and 2014 specification of tyres.",
            "In the week following the British Grand Prix, the FIA announced a total ban on the Front-and-Rear Interconnected suspension system (commonly abbreviated as FRIC) starting with immediate effect on the grounds that it was a movable aerodynamic device under Article 3.15 of the technical regulations. The FRIC system linked the front and rear suspension arrays together, using inertia to transfer hydraulic fluid across the car to offset the effects of weight transfer on the car under braking, acceleration and cornering, thereby creating a static ride height and improving stability.",
            "The use of false camera mountings was banned. Teams had previously exploited a loophole in the regulations that allowed them to add additional pieces of bodywork to the car in the place of camera mountings and take advantage of the aerodynamic benefits. From 2014, this loophole was closed, with the regulations rewritten to only allow camera mountings to be used for cameras. This rule was later updated to force the teams to mount the cameras on an external piece of bodywork after Red Bull fitted its cameras within the nose of the RB10 chassis.",
            "Sporting regulations[edit]",
            "Mid-season testing returned in 2014. Three European venues each hosted a two-day test in the week following the Grand Prix held at the circuit with one test being held in the week after the final round in Abu Dhabi. In addition to this, teams had to dedicate one of these days to aiding tyre supplier Pirelli in the development of their tyres. These rules were later adjusted to allow teams to choose which venues they tested at during the season. Additionally, cars were also classified as \"current\", \"previous\" and \"historic\", with the FIA introducing limits on which cars could be used and the conditions under which they were tested. The end-of-season Young Driver Tests, which were held to give teams the opportunity to assess rookie drivers, were discontinued.",
            "The penalty system was overhauled in 2014 so as to improve driving standards, with the introduction of a \"penalty points\" system for driving offences. Under the system, driving offences carried a pre-determined points value based on their severity. These points were tallied up over the course of a season, with a driver receiving a race ban after accumulating twelve penalty points. Any driver who received a race ban would also have received an additional five penalty points upon their return, as a form of probation to discourage further driving offences. Penalty points remained on a driver's licence for twelve months, at which point they will have been removed.",
            "Stewards were given the power to hand out five-second penalties in addition to the existing range of penalties within their power. The five-second penalties were introduced for situations where a penalty was justified, but the existing penalties—such as a drive-through or a stop/go penalty—were considered too severe, or where such a penalty would radically alter the outcome of a race if applied retroactively, with penalised drivers facing the loss of championship points for otherwise minor violations of the rules. Drivers were permitted to serve these penalties before a regular pit stop, with the driver stopping in their pit bay for five seconds before any work was carried out on the car. The five-second penalty could also be added to a driver's total race time in the event that it was issued after they had made their final pit stop. Drivers serving drive-through or stop/go penalties were still not permitted to serve a penalty ahead of their pit stop, and were instead required to enter the pit lane separately to serve the penalty.",
            "The rules regarding unsafe pit releases—when a car is released from its pit bay to the lane directly into the path of an oncoming car—were rewritten, with the driver who was released in an unsafe fashion given a grid penalty for the next race.",
            "The pit lane speed limit was reduced from 100 km/h (62 mph) to 80 km/h (50 mph).",
            "Drivers were only able to use five engines over the course of a season in 2014, down from eight in 2013. Drivers who used a sixth engine started the race from the pit lane, as opposed to the ten-place grid penalty handed down for going over the engine quota in previous season. Drivers were only able to use five individual components of each power unit element over the course of the season. If a driver went over this quota for any individual element, they incurred a ten-place grid penalty. They would receive a further five-place penalty for going over the five-unit allocation of any other element after the original ten-place penalty was applied in a bid to stop teams changing multiple elements of the engine unit after receiving a grid penalty.",
            "In the event that such a penalty relegated a driver past the back row of the grid, the remaining penalty carried over to the next race. For example, if a driver qualified in nineteenth position and received a five-place grid penalty, they dropped to twenty-second and last place for that race, and then would receive an additional two-place penalty in the next Grand Prix. These penalties could only be carried over to the next race, rather than accumulate, and only applied to penalties issued for going over the component quota. Penalties cannot be carried over from season to season; when a driver incurred such a penalty during the final race of the season, the stewards had the power to issue time penalties during the race.",
            "The procedure for issuing penalties for speeding under yellow flag conditions in qualifying was changed for 2014. Previously, drivers had been forced to slow down in the timing sector of the circuit where a yellow flag was being waved. However, after a series of penalties were issued to drivers for speeding in a sector with yellow flags when the incident that triggered the yellow flag took place behind them, the FIA introduced a change to the procedure. Starting in 2014, the circuits were divided into two hundred metre intervals. In the event of a yellow flag, drivers had to demonstrate that they slowed down in the two hundred metres immediately before and after the yellow flags while they were being displayed, or else incurred a penalty.",
            "Following Jules Bianchi's accident at the Japanese Grand Prix, the FIA announced plans to introduce a mandatory speed limiter to cars that could be remotely activated from Race Control in the event of a yellow flag. Labelled \"Virtual Safety Car\" (VSC), the system is an alternative to the use of an actual safety car and was first tested during practice at the United States Grand Prix. The system originally aimed at restricting drivers to a 100 km/h (62 mph) speed limit under specific yellow flag situations, following reports that Bianchi had been travelling at 212 km/h (132 mph) when he left the circuit. Similar trials were conducted in Brazil and Abu Dhabi, with VSC ultimately being managed through specified sector (delta) times rather than a speed limit in affected sectors.",
            "Following a series of high-profile incidents involving tyres throughout the 2013 season that culminated in a string of explosive blow-outs at the 2013 British Grand Prix, the FIA passed a resolution granting them the power to change the specifications of the tyres used by competitors with immediate effect should the need arise.",
            "Drivers were assigned permanent numbers for the duration of their careers, with the championship adopting a system similar to the one used in MotoGP. The number 1 was the champion's right, with drivers free to choose any number from 2 to 99; the champion's \"regular\" number was reserved while the champion was using the number 1. The regulations further stipulated that a driver's number had to be clearly visible, both on their car and on their helmet. Previously, the numbering system had been partially based on the World Constructors' Championship finishing positions from the previous year.",
            "Drivers who did not take part in a qualifying period were assigned grid positions based on the qualifying bracket they were in at the time and their Free Practice 3 lap times. For example, if two drivers qualified for but did not take part in Q3, they started the race from ninth and tenth places, with the positions they took decided by their FP3 times. The rule was rewritten as grid positions for drivers who had not set lap times or left the pits had previously been decided by car numbers.",
            "The FIA introduced the \"Pole Trophy\", a non-championship award presented to the driver who qualified on pole for the most races.",
            "The qualifying format was adjusted to allow drivers more time to complete flying laps in Q3. The final qualifying period was extended to twelve minutes in length, with Q1 scaled back to eighteen minutes to keep the entire session within one hour.",
            "The 107% rule was relaxed at the start of the season to account for teams dealing with the challenges that arose from the new engine regulations. FIA Race Director Charlie Whiting was quoted as saying that the enforcement of the rule would be taken on a case-by-case basis, but that the stewards would consider a driver able to qualify provided they set consistent lap times in Free Practice.",
            "The FIA introduced a curfew system in 2011 that prohibited team personnel from accessing the circuit in the six hours before the first session of the day, with teams given four \"jokers\"—exceptions to the rule that allowed them to stay within the circuit boundaries past the curfew hours without penalty so as to complete work on cars—to use throughout the season. The rule was revised for 2014, with teams given six exceptions over the course of the year as a response to the introduction of the new engine formula.",
            "Drivers had to be able to return to the pits under their own power after the chequered flag had fallen in a bid to stop drivers from pulling over in order to preserve the mandatory one-litre fuel sample required to pass post-race scrutineering.",
            "Teams were now allowed to run up to four drivers during both Friday practice sessions,[c] though they were still limited to entering a maximum of two cars during the sessions. If one of the team's nominated drivers was unable to take part, any replacement driver had to use the engine, gearbox and tyres which were allocated to the original driver.",
            "The final race of the season offered double points to teams and drivers in a bid to keep the championship fight alive for longer.",
            "Starting as of the Singapore Grand Prix, the FIA restricted pit-to-car communications, banning any radio transmissions between driver and team or pit boards displaying information that are deemed to be related to the performance of the driver or their car—such as discussing sector times relative to other cars—under Article 20.1 of the sporting regulations, which stated that a competitor must drive the car unaided."
        ]
    },
    "2015": {
        "Regulation changes": [
            "Technical[edit]",
            "Power units[edit]",
            "Sparks returned in 2015 due to titanium skid blocks attached to the underside of the cars.",
            " The number of power units a driver could use in a season was reduced from five in 2014 to four in 2015. This was tweaked after the 2015 British Grand Prix, with new power unit manufacturers being allowed one other power unit in their first season of competition; the only manufacturer affected in the 2015 season was Honda, who were allowed to take advantage of the rule even though it had been introduced after the season had begun. The rules regarding engine development that were introduced for the previous season were changed as well, with the manufacturers allowed to perform half the development permitted in 2014.",
            "Noses[edit]",
            "Following the backlash over \"ugly\" nose designs in 2014, the FIA moved to amend the rules surrounding nose designs for the 2015 season. Noses were lower than in 2014, retaining a minimum cross section, but they had to taper to a point at a fixed linear rate, effectively outlawing the dramatic finger shapes seen in 2014 in favour of a more gradual shape. Furthermore, the design of the nose had to be symmetrical and consistent with the centreline of the car, thereby banning the more exotic designs, such as the \"twin-tusk\" approach used by Lotus on the E22 chassis.",
            "Weight and bodywork[edit]",
            "The minimum weight of the cars at all times during an event was increased to 702 kilograms (1,548 lb), a difference of 10 kilograms (22 lb) from 2014, addressing concerns raised the year before that the lighter weight limit forced taller drivers to become unhealthily slim. The ban on front-and-rear interconnected suspension systems (FRIC) that had been implemented in the middle of the 2014 season was formalised, with the regulations stating that the front and rear suspension had to be designed in such a way that any change in performance had to be a direct result of a change in load applied solely to them. The anti-intrusion panels on both sides of the survival cell were extended upwards to the rim of the cockpit and alongside the driver's head in order to improve the drivers' safety in event of a side impact. Titanium skid blocks on the underside of the car were made mandatory for the 2015 season, which led to a return of sparks being created by the cars as the underbody touched the track.",
            "Sporting regulations[edit]",
            "Penalties[edit]",
            "Several rules regarding penalties were changed for the 2015 season. The replacement of a complete power unit, exceeding the maximum number allowed per season, no longer resulted in a penalty in itself. Penalties continued to be applied cumulatively for the replacement of individual components of the power unit, and if such a grid place penalty was imposed and the driver's starting position was such that it could not be applied in full, the remainder of the penalty was no longer carried over to the next race, but was instead applied in the form of a time penalty during the race corresponding to the number of grid spaces remaining in the penalty. This was tweaked after the 2015 British Grand Prix with immediate effect, to make demotion to the back of the grid the maximum penalty for engine changes. Additional time penalties to be served during the race were abandoned.",
            "As well as the existing five-second penalty that could be served during a driver's scheduled pit stop, a new ten-second penalty was introduced, to be served in the same manner. If a car was deemed to have been released from a pit stop in an unsafe manner, the driver would receive a ten-second stop-and-go penalty. Further penalties could be applied if the stewards believed the driver was aware of this and attempted to drive the car regardless. If any team personnel or team equipment remained on the grid after the fifteen-second signal had been shown before the start of the formation lap, the driver of the car concerned would have had to start the race from the pit lane. If the driver concerned failed to obey this, they would have received a ten-second stop-and-go penalty.",
            "Schedule and points[edit]",
            "The rules regarding qualifying and the start times of some races were tweaked. The qualifying procedure was further clarified to cater to different sizes of starting grids: if twenty-four cars were entered for the race, seven would have been eliminated after each of the first two qualifying segments; if twenty-two were entered, six would have been eliminated after each qualifying segment and so on if fewer cars were eligible. In light of a regulation introduced in 2014 dictating that a race could not run for more than four hours and following recommendations from the report into Jules Bianchi's accident the previous season, the start times of five Grands Prix were moved forward by an hour so races did not start with less than four hours until dusk. Thus, the Australian, Malaysia, Chinese, Japanese and Russian Grands Prix started an hour earlier than in 2014.",
            "Safety innovations[edit]",
            "There were other changes introduced in a bid to further increase the safety of the sport. In the aftermath of Bianchi's accident, a new procedure called the Virtual Safety Car (VSC) was introduced following trials during the last three Grands Prix of 2014. The procedure could be initiated when double waved yellow flags were needed on any section of a circuit where competitors and officials were in danger, but the circumstances did not warrant deployment of the actual safety car. It obliged drivers to reduce their speed to match one indicated on the displays on their steering wheels. The safety car procedure was amended as well: once the last lapped car had passed the leader, the safety car returned to the pit lane at the end of the following lap. This was a change of the previous practice which required the unlapped cars to have caught up with the back of the pack before the safety car could return to the pit lane.",
            "If a race were suspended (red-flagged), the cars would no longer have lined up on the grid but instead would have slowly proceeded to the pit lane. The pit exit would have been closed and the first car to arrive in the pit lane would have proceeded to the exit with the others lining up behind in the order in which they arrived, regardless of race standing or garage location. Severe circumstances could still have required cars to stop immediately on track.",
            "Other[edit]",
            "Beginning with the Belgian Grand Prix, radio communication from engineers to drivers pertaining to race starts, such as recommended torque map settings for optimal acceleration, was no longer allowed. This restriction added to the partial radio ban implemented at the end of the previous season. Drivers were also no longer permitted to change the design of their helmet in-season. The time limit rule was also adjusted, so that after races reached two hours and the leader completed a lap, an additional full lap would be run before the race ended."
        ]
    },
    "2016": {
        "Regulation changes": "None relevant"
    },
    "2017": {
        "Regulation changes": "None relevant"
    },
    "2018": {
        "Regulation changes": "None relevant"
    },
    "2019": {
        "Regulation changes": "None relevant"
    },
    "2020": {
        "Regulation changes": [
            "Sporting regulations[edit]",
            "Teams were allowed to use an additional MGU-K compared to 2019 to compensate for the increased demands of contesting the originally planned twenty-two races.[clarification needed]",
            "Drivers who participated in free practice sessions were eligible for additional FIA Super Licence points. Any driver who completed a minimum 100 km (62 mi) during a free practice session received an additional Super Licence point on the condition that they do not commit a driving infraction. Drivers could only accrue ten Super Licence points across a three-season period from free practice sessions. The rules around helmet designs were relaxed with drivers allowed to change their design as many times as they wanted between races, having previously been restricted to a base design and one permitted major design change (excluding minor alterations) since 2015.",
            "As a result of what was then planned to be an expanded calendar, the two pre-season tests which took place at Circuit de Barcelona-Catalunya were reduced in length from four days to three days each, whilst the two in-season tests that took place at Bahrain International Circuit and Circuit de Barcelona-Catalunya in 2019 were discontinued. Teams were no longer allowed to hide their cars during testing. The amount of time in which car mechanics were prohibited from working on the car was extended from eight to nine hours.",
            "The rules surrounding jump starts and the weighbridge were relaxed with the race stewards able to hand out less severe punishments for missing the weighbridge and jump starts.",
            "Technical regulations[edit]",
            "In order to reduce the risk of punctures, the last 50 mm (2.0 in) of the front wing could no longer contain any metal. Brake ducts could no longer be outsourced and must be made and designed by the team. The amount of fuel that could be outside of the fuel tank was reduced from 2 litres (3.5 imp pt) to 250 millilitres (0.44 imp pt). A decrease in electronic driver aids meant that drivers were responsible for managing more of the car's torque during race starts.",
            "Mid-season changes[edit]",
            "From the Italian Grand Prix, drivers were only allowed to run one engine mode from the start of qualifying to the end of the race. However, drivers were still allowed to use electrical power for the powertrain throughout the race weekend."
        ]
    },
    "2021": {
        "Regulation changes": [
            "The 2021 championship was originally due to introduce significant changes to the regulations, including the sport's governance, car designs and the sporting rules but these were delayed in March 2020 in response to the disruption caused by the COVID-19 pandemic. These rule changes were instead introduced in 2022.",
            "Financial regulation",
            "The championship introduced a budget cap, with teams limited to spending a maximum of $145 million per year.[n] Teams were required to use more commercially available materials and to submit their annual expenditure. Some teams argued to further reduce the budget cap to $100 million, citing concerns that the long-term financial impact of the COVID-19 pandemic threatens the future of as many as four teams. Formula One managing director Ross Brawn stated that the sport's intention is to reduce the budget cap further in the coming years.",
            "The value of the budget cap was set for twenty-one races; each additional race increased the budget cap by $1 million, and vice versa: each race removed from the scheduled twenty-one race calendar deducted the budget cap by $1 million. However, the budget cap did not include marketing budget, drivers' salaries, and the salaries of the team's top three executives. In addition, under a later agreement among the teams regarding the introduction of sprint qualifying races, each team received an additional $500,000 for the three sprint qualifying races on top of the current budget cap, and further flexibility on budget cap in case the cars got damaged during the sprint qualifying races. There were also additional restrictions dictating how prize money can be spent. The cap only applied to expenditure related to car performance, which remained in place until 2026. In the event that a team broke the financial regulations, the team can be penalised. It was originally planned a range of punishments for exceeding their annual budget, which include being deducted championship points, having reduced testing time, a race ban, or—for the most severe cases—disqualification from the championship. However, Toto Wolff later revealed that the intended sporting penalties such as points deductions and reduced testing for budget cap breaches would not be handed out, having been voted down by three teams including Red Bull and Ferrari.",
            "Technical regulations",
            "Teams were limited in what components could be modified for the 2021 season, with this requirement introduced to ease financial pressures on teams brought about by the COVID-19 pandemic. The teams were allowed to apply for special dispensation to make changes, most notably in the case of McLaren, who were given permission to modify their car to accommodate the switch from Renault to Mercedes engines. This prompted the FIA to introduce a token system whereby teams were given a series of tokens which could be exchanged for the introduction of specific component upgrades.",
            "Some aerodynamic rule changes were enacted by the FIA. The floor of the cars were 'clipped' in order to reduce downforce for 2021. In 2020, the floor was permitted to run in a straight line from an area adjacent to the cockpit back to a point ahead of the rear tyre. However, from 2021 that point ahead of the tyre was moved 100 millimetres (3.9 in) inboard, making the floor edge a diagonal line when viewed from above. This change was expected to reduce downforce levels by 5%. Further, some slots on the edge of the floor were removed, brake duct winglets were narrowed by 40 millimetres (1.6 in) and diffuser fences were narrowed by 50 millimetres (2.0 in). These three changes have reduced downforce levels by a further 5%, meaning the 2021 regulations have seen a total 10% reduction in downforce. However, the teams increased downforce by 4–5% over the winter, so the overall downforce reduction was approximately 5%.",
            "The \"dual-axis steering\" (DAS) system developed by Mercedes in 2020 was banned, starting from 2021. The DAS system allowed the driver to adjust the toe of the front wheels to optimise mechanical grip by pulling or pushing on the steering wheel. The FIA introduced newly revised wing load tests mid-season at the French Grand Prix to clamp down on potentially excessively flexing rear wings. This comes after Lewis Hamilton and his Mercedes team had claimed, at the Spanish Grand Prix, that the rear wing of the Red Bull RB16B flexed significantly at high speed and load, allowing greater top speeds. Under 2021 Formula One regulations wings must be immobile and rigidly attached to the bodywork.",
            "From the Belgian Grand Prix onwards a new technical directive was enforced surrounding pit stop equipment after concerns teams were flouting the article 12.8.4 of Formula One technical regulations that state that pit equipment may only be filled with compressed air or nitrogen and that sensors on this equipment must 'act passively' to achieve quicker pit stop times and potentially meaning cars could be released in an unsafe condition. To help enforce this new tolerance parameters will be introduced of 0.15 seconds from when the tyres have been fitted and tightened to the dropping of the jack and 0.2 seconds from the dropping of the jack to a car being released by the pit crew. The change was originally supposed to come in for the Hungarian Grand Prix, but was postponed. In a further clarification the FIA will have the means of ensuring the new tolerance limits are adhered to by using an intelligent wheel gun.",
            "Sporting regulations",
            "It was originally proposed that teams would be required to allow a driver who had competed in fewer than two Grands Prix to replace one of their race drivers in a Friday practice session over the course of the season. Whilst these rules were intended to give a chance to more non-Formula One drivers to test a Formula One car, the wording of this rule meant that teams satisfy the requirement if one of their regular drivers was in their rookie season. Such rules were instead implemented for the 2022 season.",
            "Following the Mercedes tyre error during the 2020 Sakhir Grand Prix, where George Russell was given front tyres allocated to Valtteri Bottas during a pit stop, the FIA had adjusted the rules on tyre usage; drivers using mixed compound sets or using sets allocated to another driver on their cars were permitted to complete two laps before the driver must pit to correct the error before facing a penalty. Under the previous rules, drivers could be disqualified as soon as such error had occurred. The race time limit for red-flagged races was also be reduced from four hours to three hours. From the 2021 United States Grand Prix, lap times set under double waved yellow flags were automatically deleted.",
            "Race weekend changes",
            "For the 2021 season, the schedule of a race weekend was revised. Under the pre-existing regulations, a race weekend spanned four days, with the Thursday before the race being reserved for media and promotional events and scrutineering; however, under the new regulations all of Thursday's events were moved to the Friday morning, with the times between activities on that day being reduced. Cars were under parc fermé conditions following the end of free practice three instead of qualifying, further restricting teams and drivers from making major changes to setups ahead of the race. The length of the two Friday practice sessions were cut from 90 minutes (as had been the case since the 2007 season) to 60 minutes. The 2021 W Series for female drivers was added to the list of support racing series alongside Formula 2, Formula 3, and Porsche Supercup. The 2021 W Series season started at the Red Bull Ring, where it was a support event for the Styrian Grand Prix in late June. It ended in late October at the Mexico City Grand Prix. Formula 2 and Formula 3 supported Formula One on alternate weekends, rather than the same ones as a cost saving measure.",
            "There were a trial of sprint qualifying at the British, Italian, and São Paulo Grands Prix. Qualifying for these sprints took place on Friday afternoon in place of the normal second practice session and the sprints ran over the least number of laps to exceed 100 km (62 mi), approximately one third of a normal race distance. The result of the sprint race determined the starting grid for the main race. Three points were awarded to the winner of the sprint race, two points to the runner-up, and one point to the third-placed finisher; sprint races are set to be expanded for the 2022 season. The British Grand Prix timetable for 16–18 July revealed that there would be no running for Formula One cars until 14:30 local time on Friday with the normal Qualifying starting at 18:00. Normally, the second Practice Session would have been at around 14:00, with no running in the evening. A second practice session is due to start at 12:00 on Saturday, before the Sprint Qualifying at 16:30. The main race is due to start at 15:00 on Sunday. At events with Sprint Qualifying, the parc fermé was now brought forward to Friday after normal Qualifying, which saw drivers only allowed to use the softest available tyre with the usual requirement for the top 10 to start on the tyres they used for their best lap in Q2 removed for events including Sprint Qualifying in their schedule. There is also no requirement to make a pit stop during Sprint Qualifying, and all 20 drivers at events where Sprint Qualifying takes place were given free tyre choice ahead of Sunday's Grand Prix. Teams were given a $500,000 overall grant by the FIA to cover the cost of the scheduled three sprint races."
        ]
    },
    "2022": {
        "Regulation changes": [
            "Race direction[edit]",
            "Michael Masi, who had served as race director since the death of Charlie Whiting in 2019, was removed from the role of race director after an inquiry into the 2021 Abu Dhabi Grand Prix. As part of a restructuring of race control, Masi was replaced by former DTM race director Niels Wittich and World Endurance Championship race director Eduardo Freitas. The pair assumed the role on an alternating basis. Herbie Blash, Whiting's former deputy, was appointed as permanent senior advisor to the race director.",
            "The FIA also introduced a new virtual race control system, much like the video assistant referee in football, as well as a ban on team communications that lobby race officials. Radio between teams and FIA officials also is no longer broadcast on television in order to protect race officials. Unlapping procedures were reassessed by the Formula One Sporting Advisory Committee following the controversy of the 2021 Abu Dhabi Grand Prix and presented prior to the start of the season.",
            "Prior to the United States Grand Prix, the FIA abandoned the idea of rotating race directors, leaving Niels Wittich as the sole serving race director for the final four rounds of the championship. The rotation policy was not met with favourable reviews from drivers, as well as being in response to criticism of Eduardo Freitas's performance as race director at the Japanese Grand Prix.",
            "Technical regulations[edit]",
            "A conceptual 2022 Formula One car revealed at the 2021 British Grand Prix.The Ferrari F1-75  at the Austrian Grand Prix.",
            "The 2022 World Championship saw an overhaul of the technical regulations. These changes had been planned for introduction in 2021, with teams developing their cars throughout 2020. The introduction of the regulations was delayed until the 2022 championship in response to the COVID-19 pandemic. Once the delay was announced, teams were banned from carrying out any development of their 2022 cars during the 2020 calendar year. Prior to the season, the FIA said it anticipated that the car performance deficit between the fastest and slowest teams on the grid would be cut by half when compared to 2021.",
            "Drivers were consulted on developing the new technical regulations, that were deliberately written to be restrictive so as to prevent teams from developing radical designs that limited the ability of drivers to overtake. The FIA created a specialist Working Group, or committee of engineers, tasked with identifying and closing loopholes in the regulations before their publication. The elimination of loopholes will, in theory, stop one team from having a dominant car, and in turn allow for closer competition throughout the field while improving the aesthetics of the cars. This philosophy was a major aim of the new regulations. Red Bull car designer Adrian Newey noted that the regulation changes were the most significant in Formula One since the 1983 season.",
            "Aerodynamics and bodywork[edit]",
            "The technical regulations reintroduced the use of ground effects for the first time since venturi tunnels under cars were banned in 1983.[h] This coincides with a simplification of the bodywork, making the underside of the car the primary source of aerodynamic grip. This aims to reduce the turbulent air in the wake of the cars to allow drivers to follow each other more closely whilst still maintaining a similar level of downforce compared to previous years. Further changes to the aerodynamics are aimed at limiting the teams' ability to control airflow around the front wheels and further reduce the cars' aerodynamic wake. This includes the elimination of bargeboards, the complex aerodynamic devices that manipulate airflow around the body of the car. The front wing and endplates have been simplified, reducing the number and complexity of aerodynamic elements. The front wing must also directly connect to the nosecone, unlike pre-2022 designs where the wing could be connected to the nose via supports to create a space under the monocoque, thereby encouraging airflow under the car by way of the wing's larger surface area and the nose's increased height. The rear wings are wider and mounted higher than in previous years, with additional restrictions in place to limit the constructors' ability to use a car's exhaust gases to generate downforce. Figures released by the Working Group revealed that where a 2019-specification car following another car had just 55% of its normal levels of downforce available, a 2022-specification car following another car would have up to 86% of its normal levels of downforce.",
            "Teams have been further restricted in the number of aerodynamic upgrades they can introduce to the car, both over the course of a race weekend and over the course of the championship. These rules were introduced to further cut the costs of competing. Following the decision to delay the 2021 regulations to 2022, aerodynamic development of the cars was banned from 28 March 2020 to the end of 2020.",
            "In 2021, the championship introduced a sliding scale system to regulate aerodynamic testing. Under this system, the least successful teams in the previous year's World Constructors' Championship standings would be given additional time for aerodynamic testing. Conversely, the most successful teams would be given less time to complete testing. The system was trialled in 2021 with the results used to create a more formal, structured and steeper model for the 2022 championship.",
            "Mid-season aerodynamics directive[edit]",
            "The introduction of ground effect meant that cars that ride high off the ground get less benefit from aerodynamic ground effects, which translates to slower speed on the track. Conversely, cars that run low to the ground gain maximum speed and benefits from this effect, but only up to the point where airflow under the car is interrupted. When ground effect is interrupted, a car experiences an aerodynamic stall, and the car lifts from the track surface. When airflow re-establishes, the car is pulled down again. When this effect occurs repeatedly, it is colloquially known as \"porpoising\". Teams with low riding cars sometimes also experience \"bottoming out\", where tracks with uneven surfaces combined with a low ride height simply means the car's floor will scrape the track surface. Bottoming out and porpoising can both cause significant forces readily felt by drivers; McLaren's Daniel Ricciardo described these as being \"rattled\" or \"shaken\".",
            "By June 2022, several drivers had raised concerns about the effects of both of these problems. Haas's Kevin Magnussen had complained of nerve issues, and both of Mercedes's drivers had complained of back pain. As a result, the FIA decided that from the Belgian Grand Prix onwards a technical directive would be introduced to prevent cars from porpoising and bottoming out to an unsafe level following safety and legality concerns in the first half of the season. The FIA's proposal is for a specific addition to Article 3.15.8 of the technical regulations, addressing the flexibility of the plank underneath a car. The changes were initially proposed to come into force at the French Grand Prix but were pushed back in order to give teams enough time to comply with the directive.",
            "Power units[edit]",
            "Discussions over the 2022 engine regulations began in 2017 and were finalised in May 2018. The proposed regulations involved removing the motor generator unit–heat (MGU-H) to simplify the technology used in the engine whilst raising the maximum rev limit by 3,000 rpm. Further proposals dubbed \"plug-and-play\" would see engine suppliers bound by the regulations to make individual engine components universally compatible, allowing teams to source their components from multiple suppliers. Manufacturers would also be subject to a similar regulation concerning commercially available materials as chassis constructors would be subject to from 2021.[clarification needed][citation needed] The proposals were designed to simplify the engine technology whilst making the sport more attractive to new entrants. As no new power unit suppliers committed themselves to entering the sport in 2022, the existing suppliers proposed to retain the existing power unit formula in a bid to reduce overall development costs.",
            "The quota system of power unit components was continued in 2022, with teams given a limited number of individual components that can be used before incurring a penalty.",
            "Standardised components[edit]",
            "Standardised components were introduced in 2022, with the technical regulations requiring standard components to be in place until 2024. These standardised components include the gearbox and fuel system. Some aerodynamic components—such as the tray that sits at the front of the car floor—will also be standardised so as to restrict teams' ability to develop the area and gain a competitive advantage. Individual parts will now be classified as a way of clarifying the rules surrounding them:",
            "\"Listed parts\" refers to the parts of the car that teams are required to design by themselves.",
            "\"Standard parts\" is the name given to the parts of the car that all teams must use, including wheel rims and equipment used in pit stops.",
            "\"Transferable parts\" are parts that a team can develop and sell on to another team, such as the gearbox and the clutch.",
            "\"Prescribed parts\" are parts that teams are required to develop according to a prescriptive set of regulations. Prescribed parts include wheel arches and wheel aerodynamics.",
            "\"Open-source parts\" may be developed collectively by teams and sold on to customers. Steering wheels and the DRS mechanism are listed as open-source parts.",
            "The system of categorising parts was introduced to allow for design freedom as the overhaul to the aerodynamic regulations was highly prescriptive.",
            "Tyres[edit]",
            "Wheel diameter increased from 13 inches (33 cm) to 18 inches (46 cm). The 18-inch wheels were introduced into the Formula 2 Championship in 2020 to test changes in tyre behaviour. It was originally proposed that the use of tyre warmers—electric blankets designed to keep the tyres at the optimal operating temperature when not in use—would be banned, although this decision was later reversed after opposition from the tyre supplier Pirelli. The temperature of the tyre blankets was reduced. Previously, the front tyres could be heated to 100 °C (212 °F), while the rears were at 80 °C (176 °F). Both dropped to 70 °C (158 °F) from the start of the season. Tyre warmers will instead become a standardised piece of equipment, with all teams required to use the same product with a view to eventually phase them out altogether by 2024. While Pirelli remain the official tyre partner and provider, BBS would partner and supply the rims to all Formula One teams from 2022 as part of a four-year deal.",
            "Sporting regulations[edit]",
            "Sprint points system and events[edit]",
            "Having been first trialled under the name \"sprint qualifying\" in 2021, the format returned also for this championship with the name changed to \"sprint\". The weekend format was unchanged from 2021 and was run at the Emilia Romagna, Austrian, and São Paulo Grands Prix with points now awarded to the top eight finishers rather than the top three finishers as was the case in 2021. Unlike the previous season, the driver who sets the fastest time in qualifying was credited as the official polesitter, with the winner of sprint continuing to have the right to start the Grand Prix from the first place grid spot.",
            "The sprint was originally planned to appear at six Grands Prix before it was reduced to three in a compromise with teams, who wanted an increased cost cap for sprint races, to cover the cost of potential car damage.",
            "Points system for shortened races[edit]",
            "Following the controversy surrounding the awarding of points at the 2021 Belgian Grand Prix, which was only run behind the safety car, the criteria needed for points to be awarded for uncompleted events was altered. The requirement was changed so that no points are awarded unless a minimum of two laps had been completed under green flag conditions. Additionally, in the event of a race that was suspended and could not be restarted, points would be awarded as follows:",
            "If less than 25% of the scheduled race distance, points are awarded on a 6–4–3–2–1 basis to the top 5.",
            "If 25%–50% of the scheduled race distance is completed, points are awarded on a 13–10–8–6–5–4–3–2–1 basis to the top 9.",
            "If 50%–75% of the scheduled race distance is completed, points are awarded on a 19–14–12–10–8–6–4–3–2–1 basis to the top 10.",
            "If more than 75% of the scheduled race distance is completed, full points are awarded.",
            "The previous criteria had been in place for over 40 years prior to the change, last being altered some time between the 1977 and 1980 seasons.",
            "Additionally, the fastest lap point is now awarded only if a minimum of 50% of the scheduled race distance is completed while ending up in the top ten.",
            "Safety car procedures and protocols[edit]",
            "In light of the controversy surrounding the safety car at the 2021 Abu Dhabi Grand Prix, the procedures for the safety car restart were changed. Rather than waiting until the lap after the last car has unlapped itself from the leader, the safety car would now be withdrawn one lap after the instruction that lapped cars may unlap themselves has been given. Additionally, the wording of the regulations was altered and now state that \"all\" cars rather than \"any\" cars will be allowed to unlap themselves, if deemed safe by the race director.",
            "From the Australian Grand Prix onwards, the FIA started clamping down on the kinds of tactics Max Verstappen employed during the final safety car restart at the 2021 Abu Dhabi Grand Prix and at subsequent safety car restarts at the first two rounds of the championship, the Bahrain and Saudi Arabian Grands Prix, where he aggressively accelerated, braked, and drew alongside another car during the restart, trying to seek a tactical advantage over rival drivers. Drivers would be expected to drive in a consistent manner during race restarts.",
            "Starting tyre choice[edit]",
            "The rule that had been in place since 2014, requiring drivers that advance to the third segment of qualifying to start the race on the tyres they used to set their fastest time in the second segment of qualifying, was scrapped; all drivers now have free choice of starting tyre for the race on Sunday at all events.",
            "Financial regulations[edit]",
            "In July, ahead of the 11th round, the Austrian Grand Prix, it was announced that the planned spending allowance of US$141.2 million would be increased by 3.1% after concerns that high inflation could lead to several teams spending over the originally planned budget cap."
        ]
    }
}